Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/trainings/t3_r_setup/operating_systems/windows_os.po
Languages: es

source: Windows users
es: Usuarios de Windows

source: Click on `Download R for Windows <https://cran.r-project.org/bin/windows/>`_.
es: Haz clic en `Descargar R para Windows <https://cran.r-project.org/bin/windows/>`_.

source: image1
es: imagen1

source: Select the `base <https://cran.r-project.org/bin/windows/base/>`_ version. This will link to where you can can download the file.
es: Selecciona la versión `base <https://cran.r-project.org/bin/windows/base/>`_. Este enlace te llevará al sitio donde puedes descargar el archivo.

source: image2
es: imagen2

source: Click on `Download R-4.4.2 for Windows <https://cran.r-project.org/bin/windows/base/R-4.4.2-win.exe>`_ (the current version at the time of writing). The link will download an installer program, which installs the most up-to-date version of R for Windows.
es: Haz clic en `Descargar R-4.4.2 para Windows <https://cran.r-project.org/bin/windows/base/R-4.4.2-win.exe>`_ (la versión actual en el momento de escribir esto). Este enlace descargará un programa de instalación, que instalará la versión más reciente de R para Windows.

source: Run the downloaded program and step through the installation wizard that appears. The wizard will install R into your program files folders and place a shortcut in your Start menu.
es: Ejecuta el programa descargado y sigue el asistente de instalación que aparecerá. El asistente instalará R en las carpetas de archivos de programa y creará un acceso directo en el menú Inicio.

source: Additional installations
es: Instalaciones adicionales

source: For Windows users we also recommend installing the `RTools <https://cran.r-project.org/bin/windows/Rtools/rtools44/rtools.html>`_ package. *RTools* is toolchain bundle used for building *R* packages from source, which may require a software compiler that may not be available on most Windows systems.
es: Para los usuarios de Windows, también recomendamos instalar el paquete `RTools <https://cran.r-project.org/bin/windows/Rtools/rtools44/rtools.html>`_. *RTools* es un conjunto de herramientas utilizado para compilar paquetes de *R* desde el código fuente, lo que puede requerir un compilador de software que puede no estar disponible en la mayoría de los sistemas Windows.

source: These compilers (Xcode, GCC, C++, Fortan, etc.) are often/typically installed on MacOS and Linux systems, so this extra installation does not apply to you if your systems runs either of these OS.
es: Estos compiladores (Xcode, GCC, C++, Fortran, etc.) suelen estar instalados en sistemas MacOS y Linux, por lo que esta instalación adicional no se aplica si tu sistema ejecuta alguno de estos sistemas operativos.

source: To download RTools, click the `Rtools44 installer <https://cran.r-project.org/bin/windows/Rtools/rtools44/files/rtools44-6414-6401.exe>`_ link, download the file, run it, and follow the installation instructions.
es: Para descargar RTools, haz clic en el enlace `Instalador de Rtools44 <https://cran.r-project.org/bin/windows/Rtools/rtools44/files/rtools44-6414-6401.exe>`_, descarga el archivo, ejecútalo y sigue las instrucciones de instalación.
