Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/trainings/t3_r_setup/creating_r_projects.po
Languages: es

source: R Projects
es: Proyectos de R

source: Why Use R Projects?
es: ¿Por qué usar proyectos de R?

source: *R* Projects provide a structured way to organize your work in *R*. They help manage file paths, working directories, and dependencies, ensuring that code runs consistently. Benefits include:
es: Los proyectos de *R* proporcionan una forma estructurada de organizar tu trabajo en *R*. Ayudan a gestionar rutas de archivos, directorios de trabajo y dependencias, asegurando que el código se ejecute de manera consistente. Sus beneficios incluyen:

source: **Self-contained workflows**: Keeps all scripts, data, and outputs in one directory.
es: **Flujos de trabajo autónomos**: Mantiene todos los scripts, datos y resultados en un solo directorio.

source: **Automatic working directory management**: Avoids the need to use ``setwd()``, ensuring that paths remain consistent.
es: **Gestión automática del directorio de trabajo**: Evita la necesidad de usar ``setwd()``, asegurando que las rutas sean consistentes.

source: **Version control integration**: Works seamlessly with Git and GitHub.
es: **Integración con control de versiones**: Funciona sin problemas con Git y GitHub.

source: **Easier collaboration**: Facilitates sharing and replicability of projects.
es: **Colaboración más sencilla**: Facilita el intercambio y la replicabilidad de los proyectos.

source: Setting Up an R Project
es: Configuración de un proyecto de R

source: Creating a New R Project
es: Creando un nuevo proyecto de R

source: To create a new R Project in **RStudio**:
es: Para crear un nuevo proyecto de R en **RStudio**:

source: Open **RStudio**.
es: Abre **RStudio**.

source: Go to **File → New Project...**.
es: Ve a **Archivo → Nuevo Proyecto...**.

source: Choose **New Directory**.
es: Selecciona **Nuevo Directorio**.

source: Select **Empty Project** (you can also use project templates, but ww will not go into tha there).
es: Selecciona **Proyecto Vacío** (también puedes usar plantillas de proyectos, pero no entraremos en detalle aquí).

source: Choose a directory name and location.
es: Elige un nombre y una ubicación para el directorio.

source: Click **Create Project**.
es: Haz clic en **Crear Proyecto**.

source: RStudio will now open the new project with a ``*.Rproj`` file, managing paths automatically.
es: RStudio abrirá ahora el nuevo proyecto con un archivo ``*.Rproj``, gestionando automáticamente las rutas de los archivos.

source: Using an Existing Directory as an R Project
es: Usar un directorio existente como un proyecto de R

source: To convert an existing directory into an R Project:
es: Para convertir un directorio existente en un proyecto de R:

source: Choose **Existing Directory**.
es: Selecciona **Directorio Existente**.

source: Browse to the directory and click **Create Project**.
es: Busca el directorio y haz clic en **Crear Proyecto**.

source: RStudio will create a ``*.Rproj`` file inside the folder, enabling project-based workflows.
es: RStudio creará un archivo ``*.Rproj`` dentro de la carpeta, habilitando flujos de trabajo basados en proyectos.

source: Now, whenever you open the ``*.Rproj`` file, RStudio will set the working directory correctly.
es: Ahora, cada vez que abras el archivo ``*.Rproj``, RStudio configurará correctamente el directorio de trabajo.
