Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/trainings/training3/03_using_rstudio.po
Languages: es

source: Using *RStudio*: A (very) brief guide!
es: Usando *RStudio*: ¡Una guía (muy) breve!

source: Now that you have both *R* and *RStudio* installed on your computer, you can begin using and interacting with *R* by opening the *RStudio* program. Open *RStudio* just as you would any program, by clicking on its icon (if you created a Desktop shortcut) or by searching for “RStudio” in your *Menu* of installed programs (in Windows this would be your *Start Menu*).
es: Ahora que tienes tanto *R* como *RStudio* instalados en tu computadora, puedes comenzar a usar e interactuar con *R* abriendo el programa *RStudio*. Abre *RStudio* como lo harías con cualquier otro programa, haciendo clic en su ícono (si creaste un acceso directo en el escritorio) o buscando “RStudio” en el *Menú* de programas instalados (en Windows, esto sería el *Menú de Inicio*).

source: Layout
es: Disposición

source: *RStudio* has four main panes each in a quadrant of your screen. You can set what appears in each pane (through **Tools → Options** menu on Windows, **RStudio/Preference** on MacOS, and **Tools → Global Options** on Linux (Linux Mint)), but the default shows:
es: *RStudio* tiene cuatro paneles principales, cada uno en un cuadrante de tu pantalla. Puedes configurar qué aparece en cada panel (a través del menú **Herramientas → Opciones** en Windows, **RStudio/Preferencias** en MacOS, y **Herramientas → Opciones globales** en Linux (Linux Mint)), pero la configuración predeterminada muestra:

source: ``Console`` (bottom left)
es: ``Consola`` (abajo a la izquierda)

source: ``Source`` editor (top left)
es: Editor de ``Código fuente`` (arriba a la izquierda)

source: Environment, History, Connections, etc. (top right), and
es: Entorno, Historial, Conexiones, etc. (arriba a la derecha), y

source: Plots, Files, Packages, Help, Viewer, etc. (bottom right).
es: Gráficos, Archivos, Paquetes, Ayuda, Visor, etc. (abajo a la derecha).

source: Each pane can be minimized or maximized within its column by clicking the minimize/maximize buttons - you can also see if a pane is collapsed (and not visible) in this way.
es: Cada panel se puede minimizar o maximizar dentro de su columna haciendo clic en los botones de minimizar/maximizar. También puedes ver si un panel está colapsado (y no es visible) de esta manera.

source: Customising the Layout
es: Personalización de la Disposición

source: You can change the layout of the panes, and their arrangement, to something you prefer by modifying these setting within **Tools → Global Options → Pane Layout** (Linux Mint).
es: Puedes cambiar la disposición de los paneles y su organización a algo que prefieras modificando esta configuración en **Herramientas → Opciones globales → Disposición de paneles** (Linux Mint).

source: Does the default Light theme *RStudio* burn your retinas? You can also change the:
es: ¿El tema claro predeterminado de *RStudio* te quema la vista? También puedes cambiar:

source: RStudio theme
es: El tema de RStudio

source: Editor font and size, and
es: La fuente y el tamaño del editor, y

source: Editor theme
es: El tema del editor

source: in **Tools → Global Options → Appearance**.
es: en **Herramientas → Opciones globales → Apariencia**.
