Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/trainings/training3/installing_packages.po
Languages: es

source: Installing *R* packages
es: Instalación de paquetes en *R*

source: One of the most useful things about the *R* language is the very large number of software libraries that *R* users have created for often very specific use cases. Indeed, many of *R*'s most useful functions are found in these packages. An *R* package bundles together useful functions, help files, and data sets, and they can be used within your own *R* scripts once you have installed and then loaded the library in your *R* session.
es: Una de las características más útiles del lenguaje *R* es la gran cantidad de bibliotecas de software que los usuarios han creado para casos de uso muy específicos. De hecho, muchas de las funciones más útiles de *R* se encuentran en estos paquetes. Un paquete de *R* agrupa funciones útiles, archivos de ayuda y conjuntos de datos, y se pueden utilizar dentro de tus propios scripts de *R* una vez que hayas instalado y cargado la biblioteca en tu sesión de *R*.

source: Using base *R*
es: Uso de *R* base

source: Installing packages
es: Instalación de paquetes

source: To install a package we can use base *R* functions:
es: Para instalar un paquete, podemos usar las funciones base de *R*:

source: For example, within an RStudio session, type (or copy/paste) the following into the console, press ``Enter``:
es: Por ejemplo, dentro de una sesión de RStudio, escribe (o copia/pega) lo siguiente en la consola y presiona ``Enter``:

source: Multiple packages can be installed at the same time by passing (i.e., concatenating) the names of each package within the ``c()`` function.
es: Se pueden instalar múltiples paquetes al mismo tiempo pasando (es decir, concatenando) los nombres de cada paquete dentro de la función ``c()``.

source: For example, within an RStudio session, type (or copy/paste) the following into the ``Console`` panel, and press ``Enter``:
es: Por ejemplo, dentro de una sesión de RStudio, escribe (o copia/pega) lo siguiente en el panel de la ``Consola`` y presiona ``Enter``:

source: Loading packages
es: Cargando paquetes

source: To load a package that we already have correctly installed, we can use the base *R* function:
es: Para cargar un paquete que ya hemos instalado correctamente, podemos usar la función base de *R*:

source: This function can be used in the console as well; however, typically we will want to load installed packages within a script we are developing, that will be saved (as a ``.R`` file) for later use. By convention, best practice is to install and load all necessary packages to run each script at the top of the *R* script, one package per line (although, see the :ref:`pacman` section below). First, within your open *RStudio* session, we need to create a new R Script, either by:
es: Esta función también se puede usar en la consola; sin embargo, normalmente querremos cargar los paquetes instalados dentro de un script que estemos desarrollando, el cual será guardado (como un archivo ``.R``) para su uso posterior. Por convención, la mejor práctica es instalar y cargar todos los paquetes necesarios para ejecutar cada script en la parte superior del script de *R*, un paquete por línea (aunque, consulta la sección :ref:`pacman` a continuación). Primero, dentro de tu sesión abierta de *RStudio*, debemos crear un nuevo script de *R*, ya sea:

source: Clicking on **File → New File → R Script** or
es: Haciendo clic en **Archivo → Nuevo archivo → Script de R** o

source: Typing ``Ctrl+Shift+N`` on your keyboard (**NOTE: your keyboard shortcuts may differ!**)
es: Presionando ``Ctrl+Shift+N`` en tu teclado (**NOTA: los atajos de teclado pueden variar!**)

source: This will open a new (empty) text file in your ``Source`` panel; type (or copy/paste) the following into the new file.
es: Esto abrirá un nuevo archivo de texto (vacío) en tu panel ``Source``; escribe (o copia/pega) lo siguiente en el nuevo archivo.

source: Before running these lines of code we must save our new script, either by:
es: Antes de ejecutar estas líneas de código, debemos guardar nuestro nuevo script, ya sea mediante:

source: Clicking on **File → Save As...**
es: Haciendo clic en **Archivo → Guardar como...**

source: These will open a dialogue window - save your file to location you will remember. It will automatically have the ``.R`` file type appended to it.
es: Esto abrirá una ventana de diálogo; guarda tu archivo en una ubicación que recuerdes. Automáticamente tendrá el tipo de archivo ``.R`` adjunto.

source: Clicking on **File → Save** will also work if you are saving a new file the first time
es: Hacer clic en **Archivo → Guardar** también funcionará si estás guardando un archivo nuevo por primera vez.

source: You can now run the new script by either:
es: Ahora puedes ejecutar el nuevo script de las siguientes maneras:

source: Clicking on the ``Source`` button (on the top right of the ``Source`` panel in RStudio)
es: Haciendo clic en el botón ``Source`` (en la parte superior derecha del panel ``Source`` en RStudio)

source: Typing ``Ctrl+Shift+S`` or ``Ctrl+Shift+Enter``.
es: Presionando ``Ctrl+Shift+S`` o ``Ctrl+Shift+Enter``.

source: Some information about the versions of you packages, and other information, may print to your ``Console`` window (or report errors if they occur... eeek!)
es: Algunas informaciones sobre las versiones de tus paquetes y otros detalles pueden imprimirse en la ventana de ``Consola`` (o mostrar errores si ocurren... ¡ups!)

source: Installing and loading packages
es: Instalación y carga de paquetes

source: One particularly useful *R* package that helps streamline the installation of R packages that are in the CRAN repositories is **pacman**. Following the conventional best practice of installing and loading all packages required to run each script at the top of the R script, **pacman** can simplify the process by both installing (if not previously installed) and loading required packages, in a more concise format.
es: Un paquete de *R* particularmente útil que ayuda a agilizar la instalación de paquetes disponibles en los repositorios de CRAN es **pacman**. Siguiendo la mejor práctica de instalar y cargar todos los paquetes necesarios para ejecutar cada script en la parte superior del mismo, **pacman** puede simplificar el proceso al instalar (si aún no está instalado) y cargar los paquetes requeridos de una manera más concisa.

source: First, create a new R Script as done previously, and save it to disk. We will need to install the **pacman** first; afterwards we can use the ``pacman::p_load()`` function both install (again, if not already installed) and load the desired packages. Type (or copy/paste) the following into the new file:
es: Primero, crea un nuevo script de *R* como se hizo anteriormente y guárdalo en el disco. Necesitaremos instalar **pacman** primero; después, podemos usar la función ``pacman::p_load()`` para instalar (nuevamente, si aún no está instalado) y cargar los paquetes deseados. Escribe (o copia/pega) lo siguiente en el nuevo archivo:

source: You can now run your script using the methods shown above (e.g., typing ``Ctrl+Shift+S``, ``Ctrl+Shift+Enter``, or clicking on the ``Source`` button).
es: Ahora puedes ejecutar tu script utilizando los métodos mencionados anteriormente (por ejemplo, presionando ``Ctrl+Shift+S``, ``Ctrl+Shift+Enter``, o haciendo clic en el botón ``Source``).
