Repository: UNDP-UNBL/elsa-documentation
Catalog: archive/sphinx-locales/*/LC_MESSAGES/trainings/training5/10_running_webtool_p1.po
Languages: es

source: Running the *Prioritizing Nature Webtool* - Data Setup
es: Ejecutando la *Herramienta web Priorizando la Naturaleza* - Configuración de Datos

source: Before the *Prioritizing Nature Webtool* app can run we needs to run a script called ``pre_run.R``. The ``pre_run.R`` script has several primary functions:
es: Antes de que la aplicación web *Priorizando la Naturaleza* pueda ejecutarse, debemos ejecutar un script llamado ``pre_run.R``. El script ``pre_run.R`` tiene varias funciones principales:

source: It reads in information from the ``prioritizing-nature-database-master.xlsx`` Excel sheet on:
es: Lee la información de la hoja de Excel ``prioritizing-nature-database-master.xlsx`` sobre:

source: Feature names (including local translations),
es: Nombres de características (incluidas las traducciones locales),

source: File names;
es: Nombres de archivos;

source: Feature weights;
es: Pesos de las características;

source: Feature impact scores; and
es: Puntajes de impacto de las características; y

source: Budget values,
es: Valores de presupuesto,

source: and other feature layers metadata (policy relevance, source info, etc)
es: y otros metadatos de capas de características (relevancia política, información de fuente, etc.)

source: It does any geospatial work needed to prepare input feature, zone, locked in area, and *prioritizr* zone data and layers, and creates file pointers to the rasters found in ``data/elsa_inputs`` so they can be used by the `terra` package.
es: Realiza cualquier trabajo geoespacial necesario para preparar las características de entrada, zonas, áreas bloqueadas y capas de datos de zonas *prioritizr*, y crea referencias a los archivos ráster en ``data/elsa_inputs`` para que puedan ser utilizados por el paquete `terra`.

source: An compressed *R* data format file called ``prioritizing_nature.Rdata`` is created at the end of the the ``pre_run.R`` - this is read back back in quickly and efficiently when the RShiny app is run, and called in the ``global.R`` function.
es: Al final del script ``pre_run.R`` se genera un archivo de datos comprimido en formato *R* llamado ``prioritizing_nature.Rdata``. Este archivo se lee rápidamente cuando se ejecuta la aplicación *RShiny* y es llamado en la función ``global.R``.

source: Running `pre_run.R`
es: Ejecutando `pre_run.R`

source: Open the ``pre_run.R`` file by typing either **Ctrl+O** or clicking on **File → Open File...** and selecting the ```pre_run.R`` file.
es: Abre el archivo ``pre_run.R`` escribiendo **Ctrl+O** o haciendo clic en **Archivo → Abrir Archivo...** y seleccionando el archivo ``pre_run.R``.

source: Inspect lines 11-18 of the script:
es: Revisa las líneas 11-18 del script:

source: Ensure that they point to the correct ``iso3`` code (i.e., ``ECU`` if you are working with Ecuador's data and ``PER`` if Peru)
es: Asegúrate de que apunten al código ``iso3`` correcto (por ejemplo, ``ECU`` si estás trabajando con los datos de Ecuador o ``PER`` si es Perú).

source: Ensure the language is set to the language you prefer: currently options are English, Spanish, and French.
es: Asegúrate de que el idioma esté configurado en el que prefieres: actualmente, las opciones son inglés, español y francés.

source: Ensure the ``input_spreadsheet`` and ``sheetname`` variables are correct.
es: Asegúrate de que las variables ``input_spreadsheet`` y ``sheetname`` sean correctas.

source: The ``blm``, ``reducedres``, and ``weight_cal`` fields should be left as is - they should only be changed if you need to rerun pre-calibration weights or do local testing on reduced resolution data (so it runs faster).
es: Los campos ``blm``, ``reducedres`` y ``weight_cal`` deben dejarse como están; sólo deben modificarse si necesitas volver a ejecutar la calibración previa de pesos o realizar pruebas locales con datos de resolución reducida (para que se ejecute más rápido).

source: Run the ``pre_run.R`` script by either
es: Ejecuta el script ``pre_run.R`` de una de las siguientes formas:

source: Typing **Ctrl+Alt+Enter** (which is the same as running:
es: Escribiendo **Ctrl+Alt+Enter** (lo que equivale a ejecutar:

source: Or clicking on the |pre_run1| button in the upper right side of the editor panel.
es: O haciendo clic en el botón |pre_run1| en la parte superior derecha del panel del editor.

source: You will see the script running in the console window - it may take several minutes depending on how powerful your computer is.
es: Verás el script ejecutándose en la ventana de la consola; puede tardar varios minutos dependiendo de la potencia de tu computadora.

source: If you see any errors here, let us know.
es: Si ves algún error aquí, avísanos.
