Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/guidance/ecuador/01_intro.po
Languages: es

source: 1. Introduction to the Prioritizing Nature in Ecuador
es: 1. Introducción a Prioritizing Nature en Ecuador

source: Background
es: Antecedentes

source: Humanity depends on nature in fundamental ways: for its livelihoods, economies, well-being and ability to mitigate and adapt to climate change. Placing nature at the center of all activities is therefore essential to ensure sustainable societies. The importance of nature has been recognized by the Parties to the Convention on Biological Diversity (CBD) with the adoption, in December 2022, of the `Kunming-Montreal Global Biodiversity Framework <https://www.cbd.int/gbf>`_.
es: La humanidad depende de la naturaleza de manera fundamental: de sus medios de vida, economías, bienestar y capacidad para mitigar y adaptarse al cambio climático. Situar la naturaleza en el centro de todas las actividades es esencial para garantizar sociedades sostenibles. La importancia de la naturaleza fue reconocida por las Partes en la Convención sobre la Diversidad Biológica (CDB) con la adopción, en diciembre de 2022, del `Marco Mundial de Biodiversidad de Kunming-Montreal <https://www.cbd.int/gbf>`_.

source: Spatial data are essential for the implementation of several GBF targets, they will also be essential for countries to monitor and report on progress towards these targets, where `41% of the headline indicators and 34% of the component indicators have a methodology that encourages the use of spatial data <https://unbiodiversitylab.org/wp-content/uploads/2024/05/SP_Guidance-Using-Spatial-Data-to-Support-GBF.pdf>`_. In this regard, `GBF Target 3 <https://www.cbd.int/gbf/targets/3>`_, also known as the 30x30 Target aims to conserve 30% of terrestrial areas, inland waters and seas by 2030. In addition to this high-level quantitative goal, the target includes qualitative elements, such as "ecologically representative, well-connected and equitably governed" systems. The target also mentions various conservation approaches, including protected areas and other effective area-based conservation measures (OECM), as well as recognition and respect for the rights of indigenous peoples and local communities. For this target, the use of geospatial data is extremely relevant for identifying conservation areas, as well as for monitoring and reporting on the impacts of various types of conservation schemes.
es: Los datos espaciales son esenciales para implementar varios objetivos del MMB y también serán fundamentales para que los países monitoreen e informen sobre el progreso hacia estos objetivos, donde `el 41 % de los indicadores principales y el 34 % de los indicadores componentes cuentan con una metodología que fomenta el uso de datos espaciales <https://unbiodiversitylab.org/wp-content/uploads/2024/05/SP_Guidance-Using-Spatial-Data-to-Support-GBF.pdf>`_. En este sentido, el `Objetivo 3 del MMB <https://www.cbd.int/gbf/targets/3>`_, también conocido como la meta 30x30, apunta a conservar el 30 % de las áreas terrestres, aguas continentales y mares para 2030. Además de este objetivo cuantitativo de alto nivel, la meta incluye elementos cualitativos, como sistemas “ecológicamente representativos, bien conectados y gobernados de manera equitativa”. La meta también menciona enfoques de conservación diversos, incluidas las áreas protegidas y otras medidas de conservación basadas en áreas efectivas (OECM), así como el reconocimiento y respeto de los derechos de los pueblos indígenas y las comunidades locales. Para esta meta, el uso de datos geoespaciales es extremadamente relevante tanto para identificar áreas de conservación como para monitorear e informar sobre los impactos de distintos esquemas de conservación.

source: Spatial prioritization mapping in support of the GBF goals
es: Mapeo de priorización espacial en apoyo a los objetivos del MMB

source: UNDP, through a partnership with Ecuador and the United Nations Environment Programme World Conservation Monitoring Centre (UNEP-WCMC), implemented the Prioritizing Nature project to support the national use of spatial data to achieve GBF Target 3 and the equivalent target at the national level. The project built on previous collaborations using innovative tools such as the `UN Biodiversity Lab <https://unbiodiversitylab.org/>`_ (UNBL) and effective methodologies such as the `Maps of Hope <http://www.mapsofhope.org/>`_ in which countries identify ELSAs where nature protection, management and restoration measures can best contribute to the achievement of various national priority policy objectives in biodiversity, climate and sustainable development.
es: El PNUD, mediante una asociación con Ecuador y el Centro Mundial de Monitoreo de la Conservación del Programa de las Naciones Unidas para el Medio Ambiente (PNUMA-ONU), implementó el proyecto Prioritizing Nature para apoyar el uso nacional de datos espaciales con el fin de alcanzar el Objetivo 3 del MMB y su equivalente a nivel nacional. El proyecto se basó en colaboraciones previas que utilizaron herramientas innovadoras como el `UN Biodiversity Lab <https://unbiodiversitylab.org/>`_ (UNBL) y metodologías eficaces como los `Mapas de la Esperanza <http://www.mapsofhope.org/>`_, en los que los países identifican ELSA donde las medidas de protección, gestión y restauración de la naturaleza pueden contribuir mejor al logro de diversos objetivos nacionales prioritarios en biodiversidad, clima y desarrollo sostenible.

source: The project mobilized key national stakeholders and experts to carry out a series of scientific activities to develop a spatial prioritization map that supports the goals of the GBF. In Ecuador, work was carried out with national partners, in particular the Ministry of Environment, Water and Ecological Transition (MAATE), to support the country to identify and assess potential conservation areas based on existing land governance and management, improve network connectivity and support the achievement of national environmental and socio-economic priorities; this led to supporting the government to propose ways of protection to meet the 30x30 Target in Ecuador.
es: El proyecto movilizó a los principales actores nacionales y expertos para realizar una serie de actividades científicas destinadas a desarrollar un mapa de priorización espacial que apoye los objetivos del MMB. En Ecuador, se trabajó con socios nacionales, en particular el Ministerio de Ambiente, Agua y Transición Ecológica (MAATE), para ayudar al país a identificar y evaluar áreas potenciales de conservación basadas en la gobernanza y gestión del territorio existentes, mejorar la conectividad de la red y apoyar el logro de las prioridades ambientales y socioeconómicas nacionales; esto permitió al gobierno proponer formas de protección para cumplir la meta 30x30 en Ecuador.

source: To develop the spatial prioritization map, Systematic Conservation Planning (SCP) was used to analyze land use zones and outcomes. SCP is used to optimize spatially explicit conservation actions to promote the persistence of biodiversity and other natural features in situ. SCP involves a transparent and objective process of setting clear goals and objectives, and then planning conservation actions that meet them. The spatial prioritization mapping process was developed to directly support the spatial elements of the GBF targets. This includes Goals 1-3, which set goals around spatial planning, sustainable management, ecosystem restoration, and protection through protected areas and OECMs. Other spatial elements were also drawn from GBF Targets 4-12, which cover threatened species, climate change and a range of ecosystem services. The project has helped Ecuador to:
es: Para desarrollar el mapa de priorización espacial, se utilizó la Planificación Sistemática de la Conservación (PSC) para analizar zonas de uso del suelo y sus resultados. La PSC se emplea para optimizar acciones de conservación espacialmente explícitas que promuevan la persistencia de la biodiversidad y otras características naturales in situ. La PSC implica un proceso transparente y objetivo de establecimiento de metas claras y posterior planificación de acciones de conservación que las cumplan. El proceso de mapeo de priorización espacial se desarrolló para apoyar directamente los elementos espaciales de los objetivos del MMB. Esto incluye los Objetivos 1-3, que establecen metas sobre planificación espacial, gestión sostenible, restauración de ecosistemas y protección mediante áreas protegidas y OECM. Otros elementos espaciales se extrajeron de los Objetivos 4-12 del MMB, que abarcan especies amenazadas, cambio climático y una variedad de servicios ecosistémicos. El proyecto ha ayudado a Ecuador a:

source: Jointly develop a spatial prioritization map that demonstrates a pathway to achieve GBF Target 3, while supporting the other targets of the GBF;
es: Desarrollar conjuntamente un mapa de priorización espacial que demuestre una ruta para alcanzar el Objetivo 3 del MMB, al mismo tiempo que apoya los demás objetivos del MMB;

source: Assess potential OECMs to support the government in identifying priority areas for site-level assessments; and
es: Evaluar posibles OECM para ayudar al gobierno a identificar áreas prioritarias para evaluaciones a nivel de sitio; y

source: Assess the condition within existing protected areas, OECMs and ecological corridors.
es: Evaluar el estado dentro de las áreas protegidas existentes, OECM y corredores ecológicos.

source: For more details on the methodology and science applied in the spatial prioritization process in Ecuador to identify priority areas to support the implementation of the GBF, please refer to the Technical Report.
es: Para más detalles sobre la metodología y la ciencia aplicadas en el proceso de priorización espacial en Ecuador para identificar áreas prioritarias que apoyen la implementación del MMB, consulte el Informe Técnico.

source: Project results are also available on the Ecuador secure workspace at the `UN Biodiversity Lab <https://unbiodiversitylab.org/>`_ a UN-supported platform that provides countries with access to the best global and national spatial data on biodiversity, ecosystem services and sustainable development. To request access to the Ecuador workspace, contact daniel.borja@ambiente.gob.ec , with a copy to support@unbiodiversitylab.org
es: Los resultados del proyecto también están disponibles en el espacio de trabajo seguro de Ecuador en el `UN Biodiversity Lab <https://unbiodiversitylab.org/>`_, una plataforma respaldada por la ONU que brinda a los países acceso a los mejores datos espaciales globales y nacionales sobre biodiversidad, servicios ecosistémicos y desarrollo sostenible. Para solicitar acceso al espacio de trabajo de Ecuador, contacte a daniel.borja@ambiente.gob.ec con copia a support@unbiodiversitylab.org.

source: The Association
es: La Asociación

source: Working with Ecuador this project brings together a powerful coalition of governments, NGOs, research institutes and intergovernmental organizations. UNDP through a partnership with Ecuador and the United Nations Environment Programme World Conservation Monitoring Center (UNEP-WCMC), with funding from the Bezos Earth Fund, implemented the Prioritizing Nature project to support the national use of spatial data to achieve GBF Target 3 and the equivalent target at the national level.
es: En colaboración con Ecuador, este proyecto reúne una poderosa coalición de gobiernos, ONG, institutos de investigación y organizaciones intergubernamentales. El PNUD, mediante una asociación con Ecuador y el Centro Mundial de Monitoreo de la Conservación del Programa de las Naciones Unidas para el Medio Ambiente (PNUMA-ONU), con financiamiento del Bezos Earth Fund, implementó el proyecto Prioritizing Nature para apoyar el uso nacional de datos espaciales con el fin de alcanzar el Objetivo 3 del MMB y su equivalente a nivel nacional.

source: Participating institutions include: Ministry of Environment, Water and Ecological Transition (MAATE) including the directorates of Protected Areas and OECM, Biodiversity, Forests and International Cooperation; National Institute of Biodiversity (INABIO), Wildlife Conservation Society (WCS-Ecuador), WWF-Ecuador, Re: Wild, GIZ Ecuador, The Nature Conservancy (TNC), Nature and Culture International (NCI), indigenous peoples and local communities were represented by the Confederation of Indigenous Nationalities of the Ecuadorian Amazon (CONFENIAE), among others.
es: Las instituciones participantes incluyen: Ministerio de Ambiente, Agua y Transición Ecológica (MAATE), incluyendo las direcciones de Áreas Protegidas y OECM, Biodiversidad, Bosques y Cooperación Internacional; Instituto Nacional de Biodiversidad (INABIO), Wildlife Conservation Society (WCS-Ecuador), WWF-Ecuador, Re:Wild, GIZ Ecuador, The Nature Conservancy (TNC), Nature and Culture International (NCI), y los pueblos indígenas y comunidades locales representados por la Confederación de Nacionalidades Indígenas de la Amazonía Ecuatoriana (CONFENIAE), entre otros.

source: Resources
es: Recursos

source: `Scoping Report <https://www.dropbox.com/scl/fi/pvdd4zj00es7oo5hm10tk/Prioritizing-Nature-in-Ecuador-Scoping-Report-v090524-Final-Clean.pdf?rlkey=dl35vjrfu8n4huankmbxwqp91&dl=0>`_: Report detailing the background, scope, vision, objectives, expected results and other relevant information about the Prioritizing Nature in Ecuador project.
es: `Informe de Alcance <https://www.dropbox.com/scl/fi/pvdd4zj00es7oo5hm10tk/Prioritizing-Nature-in-Ecuador-Scoping-Report-v090524-Final-Clean.pdf?rlkey=dl35vjrfu8n4huankmbxwqp91&dl=0>`_: Informe que detalla los antecedentes, alcance, visión, objetivos, resultados esperados y otra información relevante sobre el proyecto Prioritizing Nature en Ecuador.

source: Inception workshop:
es: Taller de inicio:

source: Recording of the inception workshop: `English <https://www.youtube.com/watch?v=CxFCDkLsZWU>`_ | `Spanish <https://www.youtube.com/watch?v=-kx6VR6d5Dk>`_
es: Grabación del taller de inicio: `Inglés <https://www.youtube.com/watch?v=CxFCDkLsZWU>`_ | `Español <https://www.youtube.com/watch?v=-kx6VR6d5Dk>`_

source: Inception workshop report: English | Spanish
es: Informe del taller de inicio: Inglés | Español

source: `Capacity building sessions <https://www.learningfornature.org/es/courses/prioritizing-nature-in-ecuador-trainings-scp-and-spatial-planning-methodology-and-applications/>`_: This series of 6 training courses provides capacity building support for the full transfer of the spatial data and planning tools produced in the Prioritizing Nature Project. It consists of a combination of self-paced courses, live training and interactive exercises that guide through the key elements of the workflow used to develop a spatial prioritization map for Target 3 of the Kunming-Montreal Global Biodiversity Framework.
es: `Sesiones de fortalecimiento de capacidades <https://www.learningfornature.org/es/courses/prioritizing-nature-in-ecuador-trainings-scp-and-spatial-planning-methodology-and-applications/>`_: Esta serie de 6 cursos de formación ofrece apoyo para la transferencia completa de los datos espaciales y las herramientas de planificación producidas en el proyecto Prioritizing Nature. Consta de una combinación de cursos autodirigidos, formación en vivo y ejercicios interactivos que guían a través de los elementos clave del flujo de trabajo utilizado para desarrollar un mapa de priorización espacial para el Objetivo 3 del Marco Mundial de Biodiversidad de Kunming-Montreal.

source: `Data included in the spatial prioritization analysis for GBF implementation in Ecuador <https://www.dropbox.com/scl/fi/4qjsbxjqaludh6vse1q8o/D-a-1-Taller-2-Ecuador-Datos-Di-Zhang.pdf?rlkey=95mkfr6gb81dn4yugstsr5ff7&st=3seojgtg&dl=0>`_: This presentation describes the datasets included in the spatial prioritization analysis that are available in the web tool for mapping priority areas for GBF implementation in Ecuador.
es: `Datos incluidos en el análisis de priorización espacial para la implementación del MMB en Ecuador <https://www.dropbox.com/scl/fi/4qjsbxjqaludh6vse1q8o/D-a-1-Taller-2-Ecuador-Datos-Di-Zhang.pdf?rlkey=95mkfr6gb81dn4yugstsr5ff7&st=3seojgtg&dl=0>`_: Esta presentación describe los conjuntos de datos incluidos en el análisis de priorización espacial que están disponibles en la herramienta web para mapear áreas prioritarias para la implementación del MMB en Ecuador.
