Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/guidance/ecuador/0210_tradeoff.po
Languages: es

source: 2.10 Analyzing synergies and trade-offs
es: 2.10 Análisis de sinergias y compensaciones

source: The objective of the *Prioritizing Nature* analysis is to identify synergies between actions for biodiversity, climate change and sustainable development. The analysis measures the outcome of each planning feature with a representation score to show where planning for the three themes (biodiversity, climate change and human well-being) creates trade-offs.
es: El objetivo del análisis *Prioritizing Nature* es identificar sinergias entre acciones para la biodiversidad, el cambio climático y el desarrollo sostenible. El análisis mide el resultado de cada elemento de planificación mediante una puntuación de representación para mostrar dónde la planificación de los tres temas (biodiversidad, cambio climático y bienestar humano) genera compensaciones.

source: Where: Trade-off score = Representation in prioritization map / Maximum representation in thematic maps.
es: Donde: Puntuación de compensación = Representación en el mapa de priorización / Representación máxima en los mapas temáticos.

source: After running an iteration of the analysis, you can view the results and evaluate whether the parameters you selected led to an acceptable representation for each of the planning features.
es: Tras ejecutar una iteración del análisis, puede ver los resultados y evaluar si los parámetros seleccionados condujeron a una representación aceptable para cada uno de los elementos de planificación.

source: Steps 1. Go to the "Results + Download" tab, scroll down to the download section of results and model parameters (summary table), there click on "Download Summary (Excel)". This will download an Excel file with the results. 2. Review the results.
es: Pasos: 1. Vaya a la pestaña «Resultados + Descarga», desplácese hasta la sección de descarga de resultados y parámetros del modelo (tabla resumen), y haga clic en «Descargar resumen (Excel)». Esto descargará un archivo de Excel con los resultados. 2. Revise los resultados.

source: Column 1 indicates the name of the planning feature.
es: La columna 1 indica el nombre del elemento de planificación.

source: Columns 2-5 indicate the representation of the planning features in the three separate planning topic scenarios and in the combined action item scenario, for example:
es: Las columnas 2 a 5 indican la representación de los elementos de planificación en los tres escenarios temáticos separados y en el escenario combinado de elementos de acción, por ejemplo:

source: Column 2 of combined topics, which includes all planning features;
es: Columna 2 de temas combinados, que incluye todos los elementos de planificación;

source: Biodiversity column 3, which includes only biodiversity planning features;
es: Columna 3 de biodiversidad, que incluye únicamente elementos de planificación de biodiversidad;

source: Climate change column 4, which includes only climate change planning features;
es: Columna 4 de cambio climático, que incluye únicamente elementos de planificación de cambio climático;

source: Human wellbeing column 5, which includes only the human welfare planning features.
es: Columna 5 de bienestar humano, que incluye únicamente elementos de planificación de bienestar humano.

source: Column 6 shows the representation of the trade-off in percentage of the prioritization scenario (in percent) compared to the largest representation among the independent planning scenarios.
es: La columna 6 muestra la representación de la compensación en porcentaje del escenario de priorización comparada con la representación máxima entre los escenarios de planificación independientes.

source: In the analysis of prioritizing nature, we normally use a threshold of 80% to define whether the trade-off is acceptable or not, for layers that have values lower than 80%, the user can optionally go back to the webtool and increase the weight of the corresponding planning features to low values, in order to increase their representation in the prioritization map.
es: En el análisis de Prioritizing Nature, normalmente usamos un umbral del 80 % para definir si la compensación es aceptable. Para las capas con valores inferiores al 80 %, el usuario puede volver a la herramienta web y aumentar el peso de los elementos de planificación correspondientes a valores bajos, con el fin de incrementar su representación en el mapa de priorización.

source: Figure 11. Download summary table
es: Figura 11. Descargar tabla resumen
