Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/guidance/ecuador/021_what.po
Languages: es

source: 2.1 What is the Prioritizing Nature webtool for?
es: ¿Para qué sirve la herramienta web Prioritizing Nature?

source: The Prioritizing Nature webtool is an interactive webtool created with *R-shiny* and connected to *prioritzr* in the backend. This tool can be used by interested Parties without the need for coding or modeling knowledge, with the same it achieves the automation of steps 5, 6 and 7 of the spatial prioritization mapping process presented in Figure 1.
es: La herramienta web Prioritizing Nature es una aplicación interactiva creada con *R-shiny* y conectada a *prioritzr* en el backend. Puede ser utilizada por las partes interesadas sin necesidad de conocimientos de programación o modelado, y automatiza los pasos 5, 6 y 7 del proceso de mapeo de priorización espacial presentado en la Figura 1.

source: Workflow for the spatial prioritization mapping in the Prioritizing Nature project.
es: Flujo de trabajo para el mapeo de priorización espacial en el proyecto Prioritizing Nature.

source: Figure 1. Workflow for the spatial prioritization mapping in the Prioritizing Nature project.
es: Figura 1. Flujo de trabajo para el mapeo de priorización espacial en el proyecto Prioritizing Nature.

source: The Prioritizing Nature webtool applications
es: Aplicaciones de la herramienta web Prioritizing Nature

source: Display the input layers or planning element;
es: Mostrar las capas de entrada o elementos de planificación;

source: View and download the resulting maps;
es: Ver y descargar los mapas resultantes;

source: Create spatial prioritization maps;
es: Crear mapas de priorización espacial;

source: Download the result maps in raster format, which can be used for further analysis according to the needs of the interested parties in software from Geographic Information Systems (GIS).
es: Descargar los mapas de resultado en formato ráster, que pueden utilizarse para análisis posteriores según las necesidades de las partes interesadas en software de Sistemas de Información Geográfica (SIG).

source: Download results and parameters of the model applied in the analysis as a summary table, which are downloaded in .xlsx and .csv formats, which can be used in Excel or other tools.
es: Descargar los resultados y parámetros del modelo aplicado en el análisis como una tabla resumen en formatos .xlsx y .csv, que pueden utilizarse en Excel u otras herramientas.

source: Create different spatial prioritization , by modifying the parameters related to the percentage (%) of the national territory allocated to protection, restoration and management target actions. These configurations can be adapted to the country's political objectives in terms of conservation, restoration, protection, among others.
es: Crear distintas configuraciones de priorización espacial modificando los parámetros relacionados con el porcentaje (%) del territorio nacional asignado a las acciones de protección, restauración y gestión. Estas configuraciones pueden adaptarse a los objetivos políticos del país en términos de conservación, restauración, protección, entre otros.

source: Edit the penalty limit factor parameter according to the analysis needs;
es: Editar el parámetro del factor de límite de penalización según las necesidades del análisis;

source: Edit the weights of each of the input layers or planning elements;
es: Editar los pesos de cada una de las capas de entrada o elementos de planificación;

source: Create prioritization maps with a new stakeholder group;
es: Crear mapas de priorización con un nuevo grupo de partes interesadas;

source: Re-run spatial the prioritization analysis with updated input layers.
es: Volver a ejecutar el análisis de priorización espacial con capas de entrada actualizadas.

source: The web-based tool executes optimizations quickly (typically within 5-10 minutes). It can therefore be used to generate and refine conservation plans in real time during stakeholder meetings, and contribute to a more transparent, inclusive and participatory decision-making process.
es: La herramienta web ejecuta optimizaciones con rapidez (habitualmente en 5-10 minutos). Puede utilizarse para generar y perfeccionar planes de conservación en tiempo real durante reuniones con las partes interesadas, contribuyendo a un proceso de toma de decisiones más transparente, inclusivo y participativo.

source: Figure 2. Interface of the Prioritizing Nature Ecuador webtool.
es: Figura 2. Interfaz de la herramienta web Prioritizing Nature Ecuador.

source: Access the Prioritizing Nature Ecuador webtool `here <https://elsa.unbiodiversitylab.org/Bezos_ECU/>`_
es: Acceda a la herramienta web Prioritizing Nature Ecuador `aquí <https://elsa.unbiodiversitylab.org/Bezos_ECU/>`_
