Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/guidance/ecuador/026_weights.po
Languages: es

source: 2.6 Editing the weights of planning features
es: 2.6 Edición de los pesos de los elementos de planificación

source: To carry out the optimization analysis, stakeholders have to decide the comparative importance of each of the planning features that outline the priority ENDB targets for Peru. This is achieved through weighting. For example, if biological corridors that help connect protected areas and crucial wildlife habitats are considered to be of high importance, this planning feature should be given greater weight (>3).
es: Para llevar a cabo el análisis de optimización, los interesados deben decidir la importancia comparativa de cada uno de los elementos de planificación que definen los objetivos prioritarios del MMB para Ecuador. Esto se logra mediante la asignación de ponderaciones. Por ejemplo, si los corredores biológicos que conectan áreas protegidas y hábitats críticos para la fauna se consideran de alta importancia, a este elemento de planificación se le debe asignar un peso mayor (>3).

source: The default weights found in the tool are based on the weights obtained from stakeholders composed of a diverse group of policy makers, experts and other stakeholders in your country.
es: Los pesos predeterminados en la herramienta se basan en las ponderaciones obtenidas de un grupo diverso de responsables políticos, expertos y otros interesados en su país.

source: **Steps**
es: **Pasos**

source: Enter a weighting for each planning feature. We recommend a scale of 0 to 10 as follows, based on the priority level of each planning feature:
es: Ingrese una ponderación para cada elemento de planificación. Recomendamos una escala de 0 a 10, según el nivel de prioridad de cada elemento de planificación:

source: 0 : not important / not taken into account
es: 0 : sin importancia / no tener en cuenta

source: 1.0 : low importance / lower importance than average
es: 1,0 : poca importancia / menor que la media

source: 5.0 : medium importance
es: 5,0 : importancia media

source: 10 : utmost importance
es: 10 : máxima importancia

source: Figure 6. Editing weights
es: Figura 6. Edición de los pesos
