Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/guidance/ecuador/03_annexes.po
Languages: es

source: 3. Annexes
es: 3. Anexos

source: 3.1 Key terms used in the process of mapping priority areas for the implementation of the GBF in Ecuador.
es: 3.1 Términos clave utilizados en el proceso de mapeo de áreas prioritarias para la implementación del MMB en Ecuador.

source: Term
es: Término

source: Definition
es: Definición

source: Application in Ecuador
es: Aplicación en Ecuador

source: Boundary Penalty Factor (BPF)
es: Factor de penalización de límite (BPF)

source: Solutions are penalized based on the total outer boundary or edge
es: Las soluciones se penalizan según el límite o borde externo total

source: of the zones. By penalizing solutions with large edge length, this BPF
es: de las zonas. Al penalizar soluciones con un largo borde, este BPF

source: can be used to promote spatial cohesion or clustering in the spatial
es: puede usarse para promover la cohesión o agrupamiento espacial en las

source: prioritization zones of priority areas for GBF implementation.
es: zonas de priorización de áreas prioritarias para la implementación del MMB.

source: A boundary penalty of 10 was applied to produce the second spatial
es: Se aplicó una penalización de límite de 10 para generar el segundo mapa de priorización espacial

source: prioritization map. This score was selected to create a scientifically
es: de priorización. Este valor se seleccionó para crear un mapa científicamente

source: rigorous but actionable map that promotes protection, management,
es: riguroso pero viable que promueva la protección, gestión,

source: and restoration in contiguous areas.
es: y restauración en áreas contiguas.

source: Objective based on areas (budget)
es: Objetivo basado en áreas (presupuesto)

source: The maximum area (expressed as a % of the total area of the country)
es: El área máxima (expresada como % del área total del país)

source: that can be assigned to an "area".
es: que puede asignarse a una “zona”.

source: Protect: 30%.
es: Proteger: 30 %.

source: Restore: 8.99%
es: Restaurar: 8,99 %.

source: Manage: 10%
es: Gestionar: 10 %.

source: Planning feature
es: Elemento de planificación

source: An element of biodiversity or ecosystem service selected as a focus
es: Un elemento de biodiversidad o servicio ecosistémico seleccionado como enfoque

source: for conservation planning or action. It may include ecological classifications,
es: para la planificación o acción de conservación. Puede incluir clasificaciones ecológicas,

source: habitat types, species, physical objects, processes, or any element
es: tipos de hábitat, especies, objetos físicos, procesos o cualquier elemento

source: that can be measured in a planning unit. In the process of spatial
es: que pueda medirse en una unidad de planificación. En el proceso de priorización espacial

source: prioritization of priority areas for GBF implementation, each priority
es: de áreas prioritarias para la implementación del MMB, cada compromiso prioritario

source: commitment for a country may correspond to one or more planning
es: de un país puede corresponder a uno o más elementos de planificación

source: features depending on its complexity.
es: según su complejidad.

source: The Prioritizing Nature for Ecuador webtool contains 16 planning features
es: La herramienta web Prioritizing Nature para Ecuador contiene 16 elementos de planificación

source: that map the 9 biodiversity targets of the GBF.
es: que representan los 9 objetivos de biodiversidad del MMB.

source: Decision support software
es: Software de apoyo a la toma de decisiones

source: A computer application that uses information about possible actions and
es: Una aplicación informática que utiliza información sobre acciones posibles y

source: the limitations of those actions to assist the decision-making process in
es: las limitaciones de dichas acciones para ayudar en el proceso de toma de decisiones

source: achieving a stated objective.
es: a lograr un objetivo determinado.

source: For the Prioritizing Nature in Ecuador project, prioritizr is used as
es: Para el proyecto Prioritizing Nature en Ecuador, se utiliza prioritizr como

source: decision support software.
es: software de apoyo a la toma de decisiones.

source: Geographic Information System (GIS)
es: Sistema de Información Geográfica (SIG)

source: Computer system consisting of hardware and software necessary for the
es: Sistema informático compuesto por hardware y software necesarios para la

source: capture, storage, management, analysis and presentation of geographic
es: captura, almacenamiento, gestión, análisis y presentación de datos

source: (spatial) data.
es: (espaciales).

source: The Prioritizing Nature webtool uses GIS software to present spatial
es: La herramienta web Prioritizing Nature utiliza software SIG para presentar datos espaciales

source: data to users. No GIS knowledge is required to use it.
es: a los usuarios. No se requiere conocimiento de SIG para usarla.

source: Restrictions
es: Restricciones

source: A constraint that must be met during optimization, as it creates a network
es: Una restricción que debe cumplirse durante la optimización, ya que crea una red

source: of areas. The main constraints are that the budget (land area devoted to
es: de áreas. Las principales restricciones son que el presupuesto (área destinada a

source: each spatial prioritization action) is not exceeded and that each zone can
es: cada acción de priorización espacial) no se exceda y que cada zona pueda

source: only occur within specified planning units (e.g. the protection zone can only
es: ocurrir únicamente dentro de unidades de planificación especificadas (p. ej., la zona de protección solo

source: be possible in planning units that are not agricultural or urban coverage).
es: ser posible en unidades de planificación que no tengan cobertura agrícola o urbana).

source: For more details, see Table 1.
es: Para más detalles, consulte la Tabla 1.

source: Planning units
es: Unidades de planificación

source: Planning units are the basic elements of a reserve system. A study area is
es: Las unidades de planificación son los elementos básicos de un sistema de reservas. Un área de estudio está

source: divided into planning units that are smaller geographic parcels of regular
es: dividida en unidades de planificación que son parcelas geográficas más pequeñas de forma regular

source: or irregular shapes. Examples are squares, hexagons, cadastral parcels and
es: o formas irregulares. Ejemplos son cuadrados, hexágonos, parcelas catastrales y

source: hydrological units.
es: unidades hidrológicas.

source: Coordinate Reference System: Custom Mollweide
es: Sistema de Referencia de Coordenadas: Mollweide personalizado

source: Pixel resolution or pixel size: 600x600m
es: Resolución o tamaño de píxel: 600 m x 600 m

source: Representation
es: Representación

source: In Systematic Conservation Planning, a representative system captures the
es: En la Planificación Sistemática de la Conservación, un sistema representativo captura el

source: full range of planning features (species, ecosystems, and ecosystem services)
es: rango completo de elementos de planificación (especies, ecosistemas y servicios ecosistémicos)

source: occurring in the planning region, not just iconic species.
es: presentes en la región de planificación, no solo especies emblemáticas.

source: In Ecuador's spatial prioritization analysis, the representation is used to
es: En el análisis de priorización espacial de Ecuador, la representación se utiliza para

source: measure how well the priority areas for GBF implementation capture or
es: medir qué tan bien las áreas prioritarias para la implementación del MMB capturan o

source: represent the elements of planning relative to a more targeted planning
es: representan los elementos de planificación en comparación con un enfoque de planificación más específico

source: approach focused solely on biodiversity, climate change or human well-being.
es: enfocado únicamente en biodiversidad, cambio climático o bienestar humano.

source: Systematic Conservation Planning (SCP)
es: Planificación Sistemática de la Conservación (PSC)

source: A formal method for identifying potential areas for conservation management
es: Un método formal para identificar áreas potenciales para la gestión de la conservación

source: that will most efficiently achieve a specific set of objectives, commonly some
es: que logren de manera más eficiente un conjunto específico de objetivos, comúnmente con

source: minimum representation of biodiversity. The process involves a clear and
es: representación mínima de biodiversidad. El proceso implica un enfoque claro y

source: structured approach to priority setting, and is now the norm for both terrestrial
es: estructurado para la definición de prioridades, y ahora es la norma tanto para la conservación terrestre

source: and marine conservation. The effectiveness of systematic conservation
es: como marina. La efectividad de la planificación sistemática de la conservación

source: planning lies in its ability to make the best use of limited fiscal resources to
es: radica en su capacidad de hacer el mejor uso de recursos fiscales limitados para

source: achieve conservation objectives and to do so in a way that is defensible,
es: lograr objetivos de conservación de manera defendible,

source: accountable, and transparently recognizes the needs of different resource users.
es: responsable y reconociendo de forma transparente las necesidades de los diferentes usuarios de recursos.

source: The SCP is the science that allows the identification of spatial prioritization
es: La PSC es la ciencia que permite la identificación de áreas de priorización espacial

source: areas for the implementation of the GBF in Ecuador.
es: para la implementación del MMB en Ecuador.

source: User interface
es: Interfaz de usuario

source: The means by which people interact with a given computer application.
es: Los medios por los cuales las personas interactúan con una aplicación informática.

source: A Graphical User Interface (GUI) presents information in a simple way
es: Una Interfaz Gráfica de Usuario (GUI) presenta información de manera sencilla

source: using graphics, menus and icons.
es: utilizando gráficos, menús e iconos.

source: The Prioritizing Nature webtool is a graphical user interface that gives
es: La herramienta web Prioritizing Nature es una interfaz gráfica de usuario que brinda

source: stakeholders the ability to run the spatial prioritization analysis themselves.
es: a los interesados la capacidad de ejecutar el análisis de priorización espacial por sí mismos.

source: Weights
es: Pesos

source: The weights allow users to set relative priorities within their priority policy
es: Los pesos permiten a los usuarios establecer prioridades relativas dentro de su política prioritaria de resultados.

source: outcomes. Values typically range from "0" (no importance) to "10"
es: Los valores suelen oscilar entre "0" (sin importancia) y "10"

source: (extremely high importance).
es: (importancia extremadamente alta).

source: The default weightings for the Ecuador spatial prioritization analysis were
es: Las ponderaciones predeterminadas para el análisis de priorización espacial de Ecuador fueron

source: developed collaboratively through stakeholder engagement sessions.
es: desarrolladas de manera colaborativa mediante sesiones de participación de las partes interesadas.

source: Stakeholders can modify these weightings through the Prioritizing
es: Los interesados pueden modificar estas ponderaciones a través de la herramienta

source: Nature webtool based on changes in priorities.
es: web Prioritizing Nature según cambios en las prioridades.

source: Zones/Shares
es: Zonas/Cuotas

source: A land use zone, equivalent to a nature-based action, which serves to
es: Una zona de uso del suelo, equivalente a una acción basada en la naturaleza, que sirve para

source: define where an action may or may not absolutely occur. For example, these
es: definen dónde una acción puede o no puede ocurrir de manera absoluta. Por ejemplo, estas

source: human footprint values).
es: Valores de huella humana).

source: In Ecuador, the spatial prioritization analysis zoning maps three different
es: En Ecuador, el zonificado del análisis de priorización espacial mapea tres acciones diferentes:

source: actions: protect, manage and restore.
es: acciones: proteger, gestionar y restaurar.

source: Data used for zoning constraints include human footprint, degraded areas,
es: Los datos utilizados para las restricciones de zonificación incluyen huella humana, áreas degradadas,

source: protected areas, urban areas and agricultural areas.
es: áreas protegidas, áreas urbanas y áreas agrícolas.

source: 3.2 Data layers used in the Prioritizing Nature project in Ecuador
es: 3.2 Capas de datos utilizadas en el proyecto Prioritizing Nature en Ecuador

source: Figure 1. Data layers used in the Prioritizing Nature project in Ecuador
es: Figura 1. Capas de datos utilizadas en el proyecto Prioritizing Nature en Ecuador
