Repository: UNDP-UNBL/elsa-documentation
Catalog: archive/sphinx-locales/*/LC_MESSAGES/trainings/training3/01_installing_r.po
Languages: es

source: Installing *R*
es: Instalando *R*

source: Installing *R* on your machine is straightforward. Follow these steps:
es: Instalar *R* en tu computadora es sencillo. Sigue estos pasos:

source: Go to the `CRAN <http://cran.r-project.org>`_ (Comprehensive *R* Archive Network) *R* website. If you type "r" into Google it is the first entry
es: Ve al sitio web de `CRAN <http://cran.r-project.org>`_ (Comprehensive *R* Archive Network). Si escribes "r" en Google, será la primera entrada.

source: Follow the instructions below for your operating system:
es: Sigue las instrucciones a continuación según tu sistema operativo:

source: Click on `Download R for Windows <https://cran.r-project.org/bin/windows/>`_.
es: Haz clic en `Descargar R para Windows <https://cran.r-project.org/bin/windows/>`_.

source: Select the `base <https://cran.r-project.org/bin/windows/base/>`_ version. This will link to where you can can download the file.
es: Selecciona la versión `base <https://cran.r-project.org/bin/windows/base/>`_. Esto te llevará a la página donde puedes descargar el archivo.

source: Click on `Download R-4.4.2 for Windows <https://cran.r-project.org/bin/windows/base/R-4.4.2-win.exe>`_ (the current version at the time of writing). The link will download an installer program, which installs the most up-to-date version of R for Windows.
es: Haz clic en `Descargar R-4.4.2 para Windows <https://cran.r-project.org/bin/windows/base/R-4.4.2-win.exe>`_ (la versión actual al momento de escribir esto). El enlace descargará un programa de instalación que instalará la versión más reciente de R para Windows.

source: Run the downloaded program and step through the installation wizard that appears. The wizard will install R into your program files folders and place a shortcut in your Start menu.
es: Ejecuta el programa descargado y sigue los pasos del asistente de instalación. El asistente instalará R en las carpetas de archivos de programa y creará un acceso directo en el menú Inicio.

source: **Additional Installations**
es: **Instalaciones Adicionales**

source: For Windows users, if you plan to use the *Gurobi* solver that will be used in :ref:`training_5`, you will also need to install the `RTools <https://cran.r-project.org/bin/windows/Rtools/rtools44/rtools.html>`_ package to enable installing *Gurobi* in *R* from source (If you do not plan to use *Gurobi*, then you can disregard this step). *RTools* is toolchain bundle used for building *R* packages from source, which may require a software compiler that may not be available on most Windows systems.
es: Para los usuarios de Windows, si planeas usar el solucionador *Gurobi* que se utilizará en :ref:`training_5`, también necesitarás instalar el paquete `RTools <https://cran.r-project.org/bin/windows/Rtools/rtools44/rtools.html>`_ para permitir la instalación de *Gurobi* en *R* desde el código fuente (Si no planeas usar *Gurobi*, puedes omitir este paso). *RTools* es un conjunto de herramientas utilizadas para compilar paquetes de *R* desde el código fuente, lo que puede requerir un compilador de software que no esté disponible en la mayoría de los sistemas Windows.

source: These compilers (Xcode, GCC, C++, Fortan, etc.) are often/typically installed on MacOS and Linux systems, so this extra installation does not apply to you if your systems runs either of these OS.
es: Estos compiladores (Xcode, GCC, C++, Fortran, etc.) suelen estar instalados en sistemas MacOS y Linux, por lo que esta instalación adicional no se aplica si tu sistema ejecuta alguno de estos sistemas operativos.

source: To download RTools, click the `Rtools44 installer <https://cran.r-project.org/bin/windows/Rtools/rtools44/files/rtools44-6459-6401.exe>`_ link, download the file, run it, and follow the installation instructions.
es: Para descargar RTools, haz clic en el enlace del `instalador de Rtools44 <https://cran.r-project.org/bin/windows/Rtools/rtools44/files/rtools44-6459-6401.exe>`_, descarga el archivo, ejecútalo y sigue las instrucciones de instalación.

source: Click on `Download R for macOS <https://cran.r-project.org/bin/macosx/>`_.
es: Haz clic en `Descargar R para macOS <https://cran.r-project.org/bin/macosx/>`_.

source: Choose the version relevant to your operating system.
es: Elige la versión correspondiente a tu sistema operativo.

source: If you have the new M1, M2, + powered mac, you will need to download the Arm version `R-4.4.2-arm64.pkg <https://cran.r-project.org/bin/macosx/big-sur-arm64/base/R-4.4.2-arm64.pkg>`_;
es: Si tienes una Mac con los nuevos procesadores M1, M2 o superiores, deberás descargar la versión para Arm `R-4.4.2-arm64.pkg <https://cran.r-project.org/bin/macosx/big-sur-arm64/base/R-4.4.2-arm64.pkg>`_;

source: If you have older Intel mac you will need to download the `R-4.4.2-x86_64.pkg <https://cran.r-project.org/bin/macosx/big-sur-x86_64/base/R-4.4.2-x86_64.pkg>`_ version.
es: Si tienes una Mac antigua con procesador Intel, deberás descargar la versión `R-4.4.2-x86_64.pkg <https://cran.r-project.org/bin/macosx/big-sur-x86_64/base/R-4.4.2-x86_64.pkg>`_.

source: An installer will download and guide you through the installation process. The installer allow you to customise your installation, but the defaults will be suitable for most users. If your computer requires a password before installing new programs, you will need it here.
es: Se descargará un instalador que te guiará a través del proceso de instalación. El instalador te permitirá personalizar la instalación, pero la configuración predeterminada será adecuada para la mayoría de los usuarios. Si tu computadora requiere una contraseña para instalar nuevos programas, la necesitarás aquí.

source: *R* comes preinstalled on many Linux distros, but you will need to have the most updated version of *R* installed.
es: *R* viene preinstalado en muchas distribuciones de Linux, pero necesitarás tener la versión más actualizada de *R* instalada.

source: To update your version of *R*, or in case you need to install it in the first place, click on `Download R for Linux <https://cran.r-project.org/bin/linux/>`_; the CRAN website provides files to build *R* from source or from the official repos on Debian, Fedora, Redhat, and SUSE, and Ubuntu-based systems. Simply select your required linux flavour and then follow the directory trail to the version of Linux you wish to install on.
es: Para actualizar tu versión de *R*, o en caso de que necesites instalarla por primera vez, haz clic en `Descargar R para Linux <https://cran.r-project.org/bin/linux/>`_; el sitio web de CRAN proporciona archivos para compilar *R* desde el código fuente o desde los repositorios oficiales en sistemas basados en Debian, Fedora, Redhat, SUSE y Ubuntu. Simplemente selecciona la distribución de Linux que necesitas y sigue la ruta del directorio hasta la versión de Linux en la que deseas instalarlo.

source: For example, Ubuntu based distros (e.g., Ubuntu, Linux Mint, etc.) can be installed via apt by adding the CRAN repository, as follows:
es: Por ejemplo, las distribuciones basadas en Ubuntu (p. ej., Ubuntu, Linux Mint, etc.) se pueden instalar a través de apt agregando el repositorio de CRAN, como sigue:

source: The exact installation procedure will vary depending on the Linux distro you use. CRAN guides the process by grouping each set of source files with documentation or README files that explain how to install on your system.
es: El procedimiento exacto de instalación variará según la distribución de Linux que utilices. CRAN guía el proceso agrupando cada conjunto de archivos fuente con documentación o archivos README que explican cómo instalarlo en tu sistema.

source: If you are a Linux user, you probably know all this by now! Apologies.
es: Si eres usuario de Linux, probablemente ya sabes todo esto. ¡Disculpas!

source: If you already have *R* installed, please ensure it has been updated recently.
es: Si ya tienes *R* instalado, asegúrate de que esté actualizado recientemente.
