Repository: UNDP-UNBL/elsa-documentation
Catalog: archive/sphinx-locales/*/LC_MESSAGES/guidance/ecuador/028_heatmap.po
Languages: es

source: 2.8 Viewing heatmaps or opportunity maps
es: 2.8 Visualización de mapas de calor o mapas de oportunidades

source: Before running the optimization, clicking on the "Results Map" in the right panel will create four heat map (HM) layers. The heat maps identify important locations for the nine biodiversity targets of the GBF for Ecuador . They are the result of the intersection of the planning features and their respective weightings. The higher the value in a range from zero to one, the more elements with high weights overlap. Thus, they can be identified as hotspots for biodiversity, climate change , human well-being or all of them combined.
es: Antes de ejecutar la optimización, al hacer clic en "Mapa de resultados" en el panel derecho se crearán cuatro capas de mapa de calor (MC). Estos mapas de calor identifican ubicaciones importantes para los nueve objetivos de biodiversidad del MMB en Ecuador. Son el resultado de la intersección de los elementos de planificación y sus respectivas ponderaciones. Cuanto mayor sea el valor en una escala de cero a uno, más elementos con ponderaciones altas se superponen. Por lo tanto, pueden identificarse como puntos críticos para la biodiversidad, la mitigación y adaptación al cambio climático, el bienestar humano o la combinación de todos ellos.

source: The heat maps can be toggled on and off, to view the heat map of priority areas for GBF implementation, which shows all planning features together (spatial heat map), or the heat maps that show only the planning features within specific themes (biodiversity, climate change , human well-being). Important areas are shown in a range of colors from green to yellow, with those in yellow being the most important.
es: Los mapas de calor pueden activarse o desactivarse para ver el mapa de calor de las áreas prioritarias para la implementación del MMB, que muestra todos los elementos de planificación juntos (mapa de calor espacial), o los mapas de calor que muestran únicamente los elementos de planificación dentro de temas específicos (biodiversidad, mitigación y adaptación al cambio climático, bienestar humano). Las áreas importantes se muestran en una gama de colores de verde a amarillo, siendo las amarillas las de mayor relevancia.

source: By looking at the heat maps before the prioritization maps, data experts can view the combined data from the planning features and determine if the patterns match their expectations and personal knowledge of the region.
es: Al observar los mapas de calor antes de los mapas de priorización, los expertos en datos pueden visualizar la información combinada de los elementos de planificación y determinar si los patrones coinciden con sus expectativas y su conocimiento personal de la región.

source: To assist in this process, users can toggle between the heat maps and the underlying satellite imagery and road maps, which helps orient the heat maps on the landscape. There are four types of heat maps in the Ecuador webtool (Table 2).
es: Para ayudar en este proceso, los usuarios pueden alternar entre los mapas de calor y las imágenes satelitales y mapas de carreteras subyacentes, lo que ayuda a orientar los mapas de calor en el paisaje. En la herramienta web de Ecuador hay cuatro tipos de mapas de calor (Tabla 2).

source: Table 2. Types of heatmaps in the Ecuador webtool.
es: Tabla 2. Tipos de mapas de calor en la herramienta web de Ecuador.

source: **Steps**
es: **Pasos**

source: Click on the "Results Map" tab in the right pane.
es: Haga clic en la pestaña "Mapa de resultados" en el panel derecho.

source: Toggle between the four heat maps to review the information before running the optimization.
es: Cambie entre los cuatro mapas de calor para revisar la información antes de ejecutar la optimización.

source: Experiment with changing the view to the "Satellite" view.
es: Pruebe cambiar la vista a "Satélite".

source: Figure 8. Heatmap of all planning features
es: Figura 8. Mapa de calor de todos los elementos de planificación
