Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/guidance/peru/022_functions.po
Languages: es

source: 2.2 Functions of the online webtool
es: 2.2 Funciones de la herramienta web en línea

source: The Prioritizing Nature webtool for Peru is hosted by the United Nations International Computing Center (UNICC) and is available online `here <https://elsa.unbiodiversitylab.org/Bezos_PER/>`_. The Prioritizing Nature webtool has been created specifically for Peru.
es: La herramienta web Prioritizing Nature para Perú está alojada por el Centro Internacional de Informática de las Naciones Unidas (UNICC) y está disponible en línea `aquí <https://elsa.unbiodiversitylab.org/Bezos_PER/>`_. La herramienta web Prioritizing Nature ha sido creada específicamente para Perú.

source: Stakeholders in Peru can achieve the following with the Prioritizing Nature webtool:
es: Los interesados en Perú pueden realizar lo siguiente con la herramienta web Prioritizing Nature:

source: Choose whether to block *potential OECMs*, *degraded areas within Protected Areas* for restoration, *potential OECMs* and *degraded areas within Protected Areas* for restoration and/or *no blocking*.
es: Elegir si bloquear *potenciales OECM*, *áreas degradadas dentro de Áreas Protegidas* para restauración, ambos (potenciales OECM y áreas degradadas dentro de Áreas Protegidas) para restauración y/o *no bloquear nada*.

source: Modify the percentage of the national territory that can be allocated to each nature-based action zone for protection, restoration and management objectives.
es: Modificar el porcentaje del territorio nacional que se puede asignar a cada zona de acción basada en la naturaleza para los objetivos de protección, restauración y gestión.

source: Edit the weights of each planning element.
es: Editar los pesos de cada elemento de planificación.

source: Execute the optimization.
es: Ejecutar la optimización.

source: View and download the ELSA action map and summary results.
es: Ver y descargar el mapa de acción ELSA y los resultados resumidos.

source: All of these parameters can be adjusted in real time so that a group of stakeholders can co-create a ELSA action map to identify priority areas to support the implementation of the GBF and the ENDB.
es: Todos estos parámetros pueden ajustarse en tiempo real para que un grupo de interesados cocree un mapa de acción ELSA que identifique áreas prioritarias para apoyar la implementación del MMB y la DEBB.

source: What stakeholders in Peru cannot achieve by using the Prioritizing Nature webtool:
es: Lo que los interesados en Perú no pueden lograr usando la herramienta web Prioritizing Nature:

source: Customize zoning restrictions.
es: Personalizar las restricciones de zonificación.

source: Load additional data layers for inclusion in the model, either as planning features or as zoning constraints.
es: Cargar capas de datos adicionales para incluir en el modelo, ya sea como elementos de planificación o como restricciones de zonificación.

source: Add additional lock-in functions.
es: Agregar funciones de bloqueo adicionales.

source: All the above parameters are coded in the backend of the Prioritizing Nature webtool by the science team, based on input from the core project team. They cannot be modified by individual users at this time.
es: Todos los parámetros anteriores están codificados en el backend de la herramienta web Prioritizing Nature por el equipo científico, basándose en la información del equipo principal del proyecto. No pueden modificarse por usuarios individuales en este momento.
