Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/guidance/peru/029_optimization.po
Languages: es

source: 2.9 Running the optimization
es: 2.9 Ejecución de la optimización

source: The ELSA actionmap shows the priority areas for the implementation of the ENDB for protection, restoration and management actions. The optimization executed by the webtool follows three rules to create the best possible map:
es: El mapa de acción ELSA muestra las áreas prioritarias para la implementación de la DEBB en acciones de protección, restauración y gestión. La optimización que ejecuta la herramienta web sigue tres reglas para crear el mejor mapa posible:

source: It should not exceed area-based targets;
es: No debe exceder los objetivos basados en áreas;

source: It must include the selected locks or non-blocks;
es: Debe incluir los bloqueos o desbloqueos seleccionados;

source: It should include the best combination of planning features based on the distribution and weighting of planning features (heat map).
es: Debe incluir la mejor combinación de elementos de planificación según la distribución y ponderación de estos (mapa de calor).

source: Once you have customized the above parameters and reviewed the heat maps, you can run the optimization analysis.
es: Una vez que haya personalizado los parámetros anteriores y revisado los mapas de calor, puede ejecutar el análisis de optimización.

source: **Steps**
es: **Pasos**

source: Prior to running the optimization, you can choose to check the box under *"Global parameters"* (Figure 9). By first checking this box, and then running the optimization, you will be able to view four maps:
es: Antes de ejecutar la optimización, puede marcar la casilla en “Parámetros globales” (Figura 9). Si primero la marca y luego ejecuta la optimización, podrá ver cuatro mapas:

source: The final ELSA actionmap, which contains the nature-based actions that are optimized for benefits in all planning features;
es: El mapa de acción ELSA final, que contiene las acciones basadas en la naturaleza optimizadas para obtener beneficios en todos los elementos de planificación;

source: One map optimized for the biodiversity planning features,
es: Un mapa optimizado para los elementos de planificación de biodiversidad,

source: One map optimized for climate change,
es: Un mapa optimizado para el cambio climático,

source: One mapa optimized for human well-being.
es: Un mapa optimizado para el bienestar humano.

source: Conversely, if you only want to display the final ELSA actionmap, you should leave this box unchecked.
es: Por el contrario, si solo desea mostrar el mapa de acción ELSA final, debe dejar esta casilla desmarcada.

source: Figure 9. Optimization and global parameters
es: Figura 9. Optimización y parámetros globales

source: Click on the *"Run optimization"* button (Figure 10). The analysis may take between 1 and 3 minutes to run. However, if the country is large (resulting in more planning units), there are a large number of planning features being used, or a high Boundary Penalty Factor is applied, it may take much longer. You should see a progress bar documenting the status of the analysis. You should not click "Run optimization" again while the analysis is running.
es: Haga clic en el botón *"Ejecutar optimización"* (Figura 10). El análisis puede tardar entre 1 y 3 minutos. Sin embargo, si el país es grande (lo que genera más unidades de planificación), se utilizan numerosos elementos de planificación o se aplica un alto Factor de Penalización de Límite, puede tardar mucho más. Debería ver una barra de progreso que muestre el estado del análisis. No haga clic en "Ejecutar optimización" nuevamente mientras el análisis esté en curso.

source: Each time you change any parameter, click again on "run optimization" to run the model and update the results report and the map.
es: Cada vez que cambie algún parámetro, haga clic de nuevo en "Ejecutar optimización" para ejecutar el modelo y actualizar el informe de resultados y el mapa.

source: Figure 10. Optimization process
es: Figura 10. Proceso de optimización
