Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/trainings/training5/04_create_r_project.po
Languages: es

source: Create a *Prioritizing Nature* *R* Project
es: Crear un Proyecto de *Prioritizing Nature* en *R*

source: We covered the benefits of and how to create an project in R in :ref:`r_projects` of :ref:`training_3`. We are now going to create one in the repository that we just downloaded end extracted.
es: Hemos cubierto los beneficios de crear un proyecto en R y cómo hacerlo en :ref:`r_projects` de :ref:`training_3`. Ahora vamos a crear uno en el repositorio que acabamos de descargar y extraer.

source: Open *RStudio*.
es: Abre *RStudio*.

source: In the upper right, click on the drop menu that shows: |proj1|
es: En la parte superior derecha, haz clic en el menú desplegable que muestra: |proj1|

source: In the dropdown menu that opens, select: |proj2|
es: En el menú desplegable que se abre, selecciona: |proj2|

source: In the window that opens, select *Existing Directory*:
es: En la ventana que se abre, selecciona *Directorio Existente*:

source: Click on *Browse* and then navigate the location of the directory you saved the downloaded repository files:
es: Haz clic en *Examinar* y luego navega hasta la ubicación del directorio donde guardaste los archivos del repositorio descargado:

source: Click *Choose* when you have entered the directory location.
es: Haz clic en *Elegir* cuando hayas seleccionado la ubicación del directorio.

source: Finally, click on the *Create Project* button.
es: Finalmente, haz clic en el botón *Crear Proyecto*.

source: This will create an ``.Rproj`` in the directory, and *RStudio* will now also show that the working directory has been set to the root of the directory. You can see this shown in the console window of *RStudio*, which should look something like the image below:
es: Esto creará un archivo ``.Rproj`` en el directorio, y *RStudio* también mostrará que el directorio de trabajo se ha establecido en la raíz del directorio. Puedes ver esto en la ventana de la consola de *RStudio*, que debería verse como la imagen a continuación:

source: The name of the project defaults to the name of the folder you create it but as with many things in *R* and *RStudio* you can change it something you find more suitable.
es: El nombre del proyecto por defecto es el mismo que el de la carpeta en la que lo creaste, pero al igual que muchas cosas en *R* y *RStudio*, puedes cambiarlo por algo que consideres más adecuado.
