Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/trainings/training5/06_installing_gurobi_r_package.po
Languages: es

source: Installing the *Gurobi R* package
es: Instalación del paquete *Gurobi R*

source: To use *Gurobi's R* interface, you will need to install the *Gurobi* package in your *R* installation. The generalised *R* command for doing this is:
es: Para usar la interfaz de *Gurobi* en *R*, necesitarás instalar el paquete *Gurobi* en tu instalación de *R*. El comando generalizado de *R* para hacerlo es:

source: The *Gurobi R* package file can be found within the directory where you installed *Gurobi* on your system (see :ref:`installing_gurobi` if you have not already successfully installed *Gurobi* on your computer). The default installation directory is:
es: El archivo del paquete *Gurobi R* se encuentra dentro del directorio donde instalaste *Gurobi* en tu sistema (consulta :ref:`installing_gurobi` si aún no has instalado *Gurobi* en tu computadora). El directorio de instalación por defecto es:

source: For **64-bit Windows**: `C:\gurobi1201win64` , and
es: Para **Windows de 64 bits**: `C:\gurobi1201win64`, y

source: For **MacOS**: `/Library/gurobi1201/macos_universal2`,
es: Para **MacOS**: `/Library/gurobi1201/macos_universal2`,

source: For **Linux** systems: `/opt/gurobi1201/linux64`
es: Para sistemas **Linux**: `/opt/gurobi1201/linux64`

source: Update the version number in the path if you have installed a different Gurobi version.
es: Actualiza el número de versión en la ruta si has instalado una versión diferente de Gurobi.

source: You will find the exact name of the file for your operating system inside the `<installdir>/R`.
es: Encontrarás el nombre exacto del archivo para tu sistema operativo dentro de `<installdir>/R`.

source: For **64-bit Windows** this is: `gurobi_12.0-1.zip` , and
es: Para **Windows de 64 bits**, este es: `gurobi_12.0-1.zip`, y

source: For **MacOS** this is: `gurobi_11.0-0_R_.tgz`,
es: Para **MacOS**, este es: `gurobi_11.0-0_R_.tgz`,

source: For **Linux** systems this is: `gurobi_12.0-1_R_.tar.gz`
es: Para sistemas **Linux**, este es: `gurobi_12.0-1_R_.tar.gz`

source: Operating specific instructions can be found below:
es: Las instrucciones específicas para cada sistema operativo se encuentran a continuación:

source: There is likely nothing else you need to do. Pat yourself on the back for using Linux and being awesome.
es: Probablemente no necesites hacer nada más. Felicítate por usar Linux y ser increíble.

source: Depending on your local *R* environment you might need to install the R package slam. To do this, you should issue the following command in the *RStudio* console:
es: Dependiendo de tu entorno local de *R*, es posible que necesites instalar el paquete de *R* slam. Para hacerlo, debes ejecutar el siguiente comando en la consola de *RStudio*:

source: Test that gurobi installed correctly by running:
es: Prueba si *Gurobi* se instaló correctamente ejecutando:

source: You will need to be careful to make sure that the *R* binary and the *Gurobi* package you install both use the same instruction set. For example, if you are using the 64-bit version of *R*, you’ll need to install the 64-bit version of *Gurobi*, and the 64-bit *Gurobi R* package. This is particularly important on Windows systems, where the error messages that result from instruction set mismatches can be quite cryptic.
es: Debes asegurarte de que el binario de *R* y el paquete *Gurobi* que instales utilicen el mismo conjunto de instrucciones. Por ejemplo, si estás usando la versión de *R* de 64 bits, necesitarás instalar la versión de *Gurobi* de 64 bits, así como el paquete *Gurobi R* de 64 bits. Esto es particularmente importante en sistemas Windows, donde los mensajes de error derivados de incompatibilidades en el conjunto de instrucciones pueden ser difíciles de interpretar.
