Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/trainings/training5/07_getting_gurobi_env.po
Languages: es

source: *Gurobi* Cloud Access
es: Acceso a la Nube de *Gurobi*

source: To access our *Gurobi* Cloud Serice solvers to run the *Prioritizing Nature Webtool* and exercises in this training, you will need to:
es: Para acceder a nuestros solucionadores en la Nube de *Gurobi* y ejecutar la herramienta web *Priorizando la Naturaleza* y los ejercicios de esta capacitación, necesitarás:

source: Have *Gurobi* installed on your computer; **AND**
es: Tener *Gurobi* instalado en tu computadora; **Y**

source: Have a valid license or key allowing access.
es: Tener una licencia o clave válida que permita el acceso.

source: See :ref:`installing_gurobi` if *Gurobi* is not correctly installed.
es: Consulta :ref:`installing_gurobi` si *Gurobi* no está correctamente instalado.

source: When the *Gurobi* software is correctly installed on your computer using *Gurobi* cloud service is as simple as having a ``gurobi.env`` file saved in the root directory of the location you are running the *Prioritizing Nature Webtool* from. The problems will automatically be sent to the cloud solver for computation, instead of trying to solve them lcoally (which would fail since you do not have a full gurobi license)
es: Cuando el software *Gurobi* está correctamente instalado en tu computadora, usar el servicio en la nube de *Gurobi* es tan simple como guardar un archivo ``gurobi.env`` en el directorio raíz desde donde estás ejecutando la herramienta *Prioritizing Nature Webtool*. Los problemas se enviarán automáticamente al solucionador en la nube para su cálculo, en lugar de intentar resolverlos localmente (lo que fallaría, ya que no tienes una licencia completa de *Gurobi*).

source: Unless you have an existing free Academic license setup.
es: A menos que ya tengas configurada una licencia académica gratuita.

source: .env Download
es: Descarga del archivo .env

source: All registered participants should have received an email notification granting you the ability to download the `gurobi.env` file for this training. If you have not received that email, or have not downloaded the .env file yet, you can do so from the link below:
es: Todos los participantes registrados deberían haber recibido un correo electrónico con la posibilidad de descargar el archivo `gurobi.env` para esta capacitación. Si no has recibido ese correo o aún no has descargado el archivo .env, puedes hacerlo desde el siguiente enlace:

source: `gurobi.env <Link TBC>`_
es: `gurobi.env <Enlace TBC>`_

source: Please save this file to the root directory of the repository you have downloaded, which is also the working directory of the *R Project* you just created.
es: Guarda este archivo en el directorio raíz del repositorio que has descargado, que también es el directorio de trabajo del *Proyecto de R* que acabas de crear.
