Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/trainings/training5/09_installing_required_r_packages.po
Languages: es

source: Installing Required *R* Packages
es: Instalación de Paquetes Requeridos de *R*

source: In :ref:`training_3` we briefly went over the basics of :ref:`installing_r_packages`.
es: En :ref:`training_3` repasamos brevemente los conceptos básicos de :ref:`installing_r_packages`.

source: In this section we are going to ensure the R packages required to run the *RShiny* *Protecting Nature Webtools* are installed on your computer. You might recall that in R one can install one or more packages using the base *R* function
es: En esta sección, vamos a asegurarnos de que los paquetes de *R* necesarios para ejecutar *RShiny* y las *Protecting Nature Webtools* estén instalados en tu computadora. Es posible que recuerdes que en *R* se pueden instalar uno o más paquetes utilizando la función base de *R*:

source: or we showed how we can use other libraries such as the ``pacman`` package to install one or more functions:
es: o mostramos cómo podemos usar otras bibliotecas, como el paquete ``pacman``, para instalar una o más funciones:

source: In the *Protecting Nature Webtools* repository that you downloaded, this is all done within the required ``start.R`` script that is needed to run the *RShiny* application itself:
es: En el repositorio de *Protecting Nature Webtools* que descargaste, todo esto se realiza dentro del script ``start.R``, que es necesario para ejecutar la aplicación *RShiny*:

source: The ``start.R`` script will not only run and open the the app in a browser (via the function call ``shiny::runApp(launch.browser = TRUE)`` in the last line), but will also check if packages are already installed, and install them if they are not.
es: El script ``start.R`` no solo ejecutará y abrirá la aplicación en un navegador (mediante la llamada a la función ``shiny::runApp(launch.browser = TRUE)`` en la última línea), sino que también verificará si los paquetes ya están instalados e instalará los que falten.

source: When we run the app (e.g., run ``start.R``) below, assuming that it correctly installs all the required *R* packages without further problems, the app will not start start and it will close with some error messages about not being able to find files. This is expected - they have not been created yet. We will address that shortly.
es: Cuando ejecutemos la aplicación (por ejemplo, al ejecutar ``start.R``), suponiendo que instale correctamente todos los paquetes de *R* requeridos sin problemas adicionales, la aplicación no se iniciará y cerrará con mensajes de error indicando que no se pueden encontrar algunos archivos. Esto es normal, ya que aún no han sido creados. Abordaremos esto en breve.

source: Running the App
es: Ejecutando la Aplicación

source: Open *RStudio* (if not already open). By default *RStudio* will open with the last opened *R Project*. If this is not the *R Project* we created perviously, click the |open_proj| button and navigate to the correct project (recently opened projects should be shown in the dropdown menu and be easy to locate).
es: Abre *RStudio* (si aún no está abierto). De forma predeterminada, *RStudio* abrirá el último *R Project* que se usó. Si este no es el *R Project* que creamos anteriormente, haz clic en el botón |open_proj| y navega hasta el proyecto correcto (los proyectos abiertos recientemente deberían aparecer en el menú desplegable y ser fáciles de ubicar).

source: Open the ``start.R`` script by either typing ``Shift+O`` on your keyboard **OR** clicking your mouse on **File → Open File...**, which will open a window showing all the files in your working directory. Select ``start.R``. You can also simply click on the **File** panel in *RStudio*, and click on the ``start.R`` file. The ``start.R`` file will open in the the editor panel.
es: Abre el script ``start.R`` escribiendo ``Shift+O`` en tu teclado **O** haciendo clic en **Archivo → Abrir archivo...**, lo que abrirá una ventana mostrando todos los archivos en tu directorio de trabajo. Selecciona ``start.R``. También puedes hacer clic en el panel **Archivo** en *RStudio* y luego hacer clic en el archivo ``start.R``. El archivo se abrirá en el panel del editor.

source: There are two ways to run the `start.R` script:
es: Hay dos formas de ejecutar el script `start.R`:

source: Click on the |start_r2| button on the top-right of the editor panel, or
es: Haz clic en el botón |start_r2| en la parte superior derecha del panel del editor, o

source: Type **Ctrl+Shift+Enter** on your keyboard.
es: Escribe **Ctrl+Shift+Enter** en tu teclado.

source: Everything will have worked perfectly and all the required *R* packages will have installed without a problem. Of course.
es: Todo habrá funcionado perfectamente y todos los paquetes de *R* requeridos se habrán instalado sin problema. Por supuesto.

source: Errors
es: Errores

source: Inevitably, many of you will encounter errors while packages are being installed when `start.R` runs.
es: Inevitablemente, muchos de ustedes encontrarán errores mientras se instalan los paquetes al ejecutar `start.R`.

source: That is why we are here today in this training - to help you all troubleshoot the possible errors that you might encounter; for instance, particular *R* packages may produce errors more commonly than others (for instance, errors with ``gdal``, ``sf`` and their dependencies can be encountered occasionally on Linux systems), as are errors related to installing packages on Windows where RTools has not been installed.
es: Por eso estamos aquí en esta capacitación: para ayudarte a solucionar los posibles errores que puedas encontrar. Algunos paquetes de *R* pueden producir errores con más frecuencia que otros (por ejemplo, errores con ``gdal``, ``sf`` y sus dependencias en sistemas Linux), al igual que los errores en la instalación de paquetes en Windows cuando RTools no ha sido instalado.

source: We are here to help.
es: Estamos aquí para ayudarte.
