Repository: UNDP-UNBL/elsa-documentation
Catalog: docs/locales/*/LC_MESSAGES/trainings/training5/index.po
Languages: es

source: Training 5: Running Spatial Prioritisations
es: Capacitación 5: Ejecución de Priorizaciones Espaciales

source: This module is an online workshop followed by interactive exercises. It will provide training on how to import the spatial data from the Prioritizing Nature Project to the prioritizr, and run the prioritizr analysis in R software to generate the spatial prioritization map.
es: Este módulo es un taller en línea seguido de ejercicios interactivos. Proporcionará capacitación sobre cómo importar los datos espaciales del Proyecto Prioritizing Nature en prioritizr, y ejecutar el análisis en R para generar el mapa de priorización espacial.

source: Participants are expected to have basic knowledge of GIS, R software and language, such as running scripts in R
es: Se espera que los participantes tengan conocimientos básicos de SIG, el software R y su lenguaje, como la ejecución de scripts en R.

source: The ELSA national tools you may have seen or used on-line are built using *RShiny*, and those we will be setting up to run locally on your computer during this workshop also use *Rshiny*. *RShiny* is an *R* package that allows users to create interactive web applications directly from *R* code without the need for specialist web programming skills - meaning that in a nutshell, users can build/run functional web applications by simply opening the application in their web browser (Chrome, Firefox, Safari, etc). Some of the key features of *RShiny* are:
es: Las herramientas nacionales de ELSA que puedes haber visto o utilizado en línea están construidas con *RShiny*, y las que configuraremos para ejecutarlas localmente en tu computadora durante este taller también usan *RShiny*. *RShiny* es un paquete de *R* que permite a los usuarios crear aplicaciones web interactivas directamente desde código en *R*, sin necesidad de conocimientos especializados en programación web. En resumen, los usuarios pueden construir y ejecutar aplicaciones web funcionales simplemente abriendo la aplicación en su navegador web (Chrome, Firefox, Safari, etc.). Algunas de las características clave de *RShiny* son:

source: It provides a web application framework for *R*, allowing for interactive app development.
es: Proporciona un marco de aplicaciones web para *R*, permitiendo el desarrollo de aplicaciones interactivas.

source: Includes reactive programming, allowing for automatically updating of outputs when inputs change.
es: Incluye programación reactiva, lo que permite la actualización automática de las salidas cuando cambian las entradas.

source: It integrates with other *R* libraries, working seamlessly with with the `tidyverse <https://www.tidyverse.org/>`_ (e.g., *ggplot2*, *dplyr*, *readr*, etc.) *leaflet*, *shinyWidgets*, *terra*, and other *R* libraries.
es: Se integra con otras bibliotecas de *R*, funcionando sin problemas con el `tidyverse <https://www.tidyverse.org/>`_ (por ejemplo, *ggplot2*, *dplyr*, *readr*, etc.), *leaflet*, *shinyWidgets*, *terra* y otras bibliotecas de *R*.

source: Apps can be deployed on Web and hosted on `ShinyApps.io <https://www.shinyapps.io/>`_, `RStudio Connect <https://posit.co/products/enterprise/connect/>`_, or on private servers (for example, one of the tools for Peru seen below).
es: Las aplicaciones pueden desplegarse en la web y alojarse en `ShinyApps.io <https://www.shinyapps.io/>`_, `RStudio Connect <https://posit.co/products/enterprise/connect/>`_ o en servidores privados (por ejemplo, una de las herramientas para Perú que se muestra a continuación).

source: We run the various national ELSA web tools on private and secure UNICC infrastructure.
es: Ejecutamos las diversas herramientas web nacionales de ELSA en una infraestructura privada y segura de UNICC.

source: ELSA Code Repositories (Git)
es: Repositorios de Código de ELSA (Git)

source: TO DO:
es: POR HACER:

source: Git hub repo download - which branch
es: Descarga del repositorio de GitHub - qué rama

source: Data and files set up
es: Configuración de datos y archivos

source: Need to run pre-run.R
es: Es necesario ejecutar pre-run.R

source: Need to set up to run locally and not via CLI
es: Es necesario configurar para ejecutar localmente y no a través de CLI

source: Download as zip file
es: Descargar como archivo ZIP

source: GIS Data Downloads
es: Descargas de Datos SIG

source: Data stacks for this workshop have been pre-created so that we can focus less on data processing and more on working with and understanding the ELSA outputs.
es: Los conjuntos de datos para este taller han sido pre-creados para que podamos enfocarnos menos en el procesamiento de datos y más en trabajar y comprender los resultados de ELSA.

source: Download the data stack for your country of interest below:
es: Descarga el conjunto de datos para tu país de interés a continuación:

source: `Peru <TBD>`_
es: `Perú <TBD>`_

source: Setting up an *R* project and file structure
es: Configuración de un proyecto en *R* y estructura de archivos

source: Setting it all up
es: Configurándolo todo
