Repository: UNDP-UNBL/elsa-documentation
Catalog: archive/sphinx-locales/*/LC_MESSAGES/guidance/peru/01_intro.po
Languages: es

source: 1. Introduction to the Prioritizing Nature in Peru
es: 1. Introducción a Prioritizing Nature en Perú

source: Background
es: Antecedentes

source: Humanity depends on nature in fundamental ways: for its livelihoods, economies, well-being and ability to mitigate and adapt to climate change. Placing nature at the center of all activities is therefore essential to ensure sustainable societies. The importance of nature has been recognized by the Parties to the Convention on Biological Diversity (CBD) with the adoption, in December 2022, of the `Kunming-Montreal Global Biodiversity Framework <https://www.cbd.int/gbf>`_.
es: La humanidad depende de la naturaleza de maneras fundamentales: para sus medios de vida, economías, bienestar y capacidad de mitigar y adaptarse al cambio climático. Por ello, situar la naturaleza en el centro de todas las actividades es esencial para garantizar sociedades sostenibles. La importancia de la naturaleza ha sido reconocida por las Partes en la Convención sobre la Diversidad Biológica (CDB) con la adopción, en diciembre de 2022, del `Marco Mundial de Biodiversidad de Kunming-Montreal <https://www.cbd.int/gbf>`_.

source: Spatial data are essential for the implementation of several GBF targets, they will also be essential for countries to monitor and report on progress towards these targets, where `41% of the headline indicators and 34% of the component indicators have a methodology that encourages the use of spatial data <https://unbiodiversitylab.org/wp-content/uploads/2024/05/SP_Guidance-Using-Spatial-Data-to-Support-GBF.pdf>`_. In this regard, `GBF Target 3 <https://www.cbd.int/gbf/targets/3>`_, also known as the 30x30 Target aims to conserve 30% of terrestrial areas, inland waters and seas by 2030. In addition to this high-level quantitative goal, the target includes qualitative elements, such as "ecologically representative, well-connected and equitably governed" systems. The target also mentions various conservation approaches, including protected areas and other effective area-based conservation measures (OECM), as well as recognition and respect for the rights of indigenous peoples and local communities. For this target, the use of geospatial data is extremely relevant for identifying conservation areas, as well as for monitoring and reporting on the impacts of various types of conservation schemes.
es: Los datos espaciales son esenciales para la implementación de varios objetivos del MMB, y también serán fundamentales para que los países monitoreen e informen sobre el progreso hacia estos objetivos, donde `el 41 % de los indicadores principales y el 34 % de los indicadores componente cuentan con una metodología que fomenta el uso de datos espaciales <https://unbiodiversitylab.org/wp-content/uploads/2024/05/SP_Guidance-Using-Spatial-Data-to-Support-GBF.pdf>`_. En este sentido, el `Objetivo 3 del MMB <https://www.cbd.int/gbf/targets/3>`_, también conocido como la meta 30x30, apunta a conservar el 30 % de las áreas terrestres, aguas continentales y mares para 2030. Además de este objetivo cuantitativo de alto nivel, la meta incluye elementos cualitativos, como sistemas “ecológicamente representativos, bien conectados y equitativamente gobernados”. La meta también menciona diversos enfoques de conservación, incluidos las áreas protegidas y otras medidas de conservación basadas en áreas efectivas (OECM), así como el reconocimiento y respeto de los derechos de los pueblos indígenas y las comunidades locales. Para este objetivo, el uso de datos geoespaciales es extremadamente relevante tanto para identificar áreas de conservación como para monitorear e informar sobre los impactos de diferentes esquemas de conservación.

source: ELSA mapping in support of the GBF and ENDB targets
es: Mapeo ELSA en apoyo de los objetivos del MMB y DEBB

source: UNDP, through a partnership with Peru and the United Nations Environment Programme World Conservation Monitoring Centre (UNEP-WCMC), implemented the Prioritizing Nature project to support the national use of spatial data to achieve GBF Target 3 and the equivalent target at the national level. The project built on previous collaborations using innovative tools such as the `UN Biodiversity Lab <https://unbiodiversitylab.org/>`_ (UNBL) and effective methodologies such as the `Maps of Hope <http://www.mapsofhope.org/>`_ in which countries identify ELSAs where nature protection, management and restoration measures can best contribute to the achievement of various national priority policy objectives in biodiversity, climate and sustainable development.
es: El PNUD, mediante una asociación con Perú y el Centro Mundial de Monitoreo de la Conservación del Programa de las Naciones Unidas para el Medio Ambiente (PNUMA-ONU), implementó el proyecto Prioritizing Nature para apoyar el uso nacional de datos espaciales con el fin de alcanzar el Objetivo 3 del MMB y su equivalente a nivel nacional. El proyecto se basó en colaboraciones previas utilizando herramientas innovadoras como el `UN Biodiversity Lab <https://unbiodiversitylab.org/>`_ (UNBL) y metodologías eficaces como los `Mapas de la Esperanza <http://www.mapsofhope.org/>`_, en los que los países identifican ELSA donde las medidas de protección, gestión y restauración de la naturaleza pueden contribuir mejor al logro de diversos objetivos prioritarios nacionales en biodiversidad, clima y desarrollo sostenible.

source: The project mobilized key national stakeholders and experts to carry out a series of scientific activities to develop an ELSA map that supports the goals of the GBF and the ENDB. In Peru, work was carried out with national partners, in particular the Ministry of Environment (MINAM), to support the country to identify and assess potential conservation areas based on existing land governance and management, improve network connectivity and support the achievement of national environmental and socioeconomic priorities; this led to supporting the government to propose forms of protection to meet the 30x30 Target in Peru.
es: El proyecto movilizó a los principales actores nacionales y expertos para llevar a cabo una serie de actividades científicas destinadas a desarrollar un mapa ELSA que apoye los objetivos del MMB y DEBB. En Perú, se trabajó con socios nacionales, en particular el Ministerio del Ambiente (MINAM), para ayudar al país a identificar y evaluar áreas de conservación potenciales basándose en la gobernanza y gestión del territorio existentes, mejorar la conectividad de la red y apoyar el logro de las prioridades ambientales y socioeconómicas nacionales; esto permitió al gobierno proponer formas de protección para cumplir la meta 30x30 en Perú.

source: To develop the ELSA map, Systematic Conservation Planning (SCP) was used to analyze land use zones and outcomes. SCP is used to optimize spatially explicit conservation actions to promote the persistence of biodiversity and other natural features in situ. SCP involves a transparent and objective process of setting clear goals and objectives, and then planning conservation actions that meet them. The ELSA mapping process was developed to directly support the spatial elements of the GBF and the ENDB targets. This includes Goals 1-3, which set goals around spatial planning, sustainable management, ecosystem restoration, and protection through protected areas and OECMs. Other spatial elements were also drawn from GBF Targets 4-12, which cover threatened species, climate change and a range of ecosystem services.
es: Para desarrollar el mapa ELSA se utilizó la Planificación Sistemática de la Conservación (PSC) para analizar zonas de uso del suelo y resultados. La PSC se emplea para optimizar acciones de conservación espacialmente explícitas que promuevan la persistencia de la biodiversidad y otras características naturales in situ. La PSC implica un proceso transparente y objetivo de definición de metas y objetivos claros, y luego la planificación de acciones de conservación que los cumplan. El proceso de mapeo ELSA se desarrolló para apoyar directamente los elementos espaciales de los objetivos del MMB y DEBB. Esto incluye los Objetivos 1-3, que establecen metas en torno a la planificación espacial, la gestión sostenible, la restauración de ecosistemas y la protección a través de áreas protegidas y OECM. Otros elementos espaciales se extrajeron de los Objetivos 4-12 del MMB, que abarcan especies amenazadas, cambio climático y una gama de servicios ecosistémicos.

source: The project has helped Peru to:
es: El proyecto ha ayudado a Perú a:

source: Jointly develop an ELSA action map that demonstrates a pathway to achieve GBF Target 3, while supporting the other targets of the GBF and Peru's NBSAP;
es: Desarrollar conjuntamente un mapa de acción ELSA que demuestre una ruta para alcanzar el Objetivo 3 del MMB, al mismo tiempo que apoya los demás objetivos del MMB y el ENP de Perú;

source: Assess potential OECMs to support the government in identifying priority areas for site-level assessments; and
es: Evaluar posibles OECM para ayudar al gobierno a identificar áreas prioritarias para evaluaciones a nivel de sitio; y

source: Assess the condition within existing protected areas and OECMs.
es: Evaluar el estado dentro de las áreas protegidas y OECM existentes.

source: For more details on the methodology and science applied in the ELSA process in Peru to identify priority areas to support the implementation of the GBF, please refer to the Technical Report.
es: Para más detalles sobre la metodología y la ciencia aplicada en el proceso ELSA en Perú para identificar áreas prioritarias que apoyen la implementación del MMB, consulte el Informe Técnico.

source: Project results are also available on the Peru secure workspace at the `UN Biodiversity Lab <https://unbiodiversitylab.org/>`_ a UN-supported platform that provides countries with access to the best global and national spatial data on biodiversity, ecosystem services and sustainable development. To request access to the Peru workspace, contactpatricia.huerta@undp.org , with a copy to support@unbiodiversitylab.org .
es: Los resultados del proyecto también están disponibles en el espacio de trabajo seguro de Perú en el `UN Biodiversity Lab <https://unbiodiversitylab.org/>`_, una plataforma apoyada por la ONU que brinda a los países acceso a los mejores datos espaciales globales y nacionales sobre biodiversidad, servicios ecosistémicos y desarrollo sostenible. Para solicitar acceso al espacio de trabajo de Perú, escriba a patrícia.huerta@undp.org con copia a support@unbiodiversitylab.org.

source: The Association
es: La Asociación

source: Working with Peru this project brings together a powerful coalition of governments, NGOs, research institutes and intergovernmental organizations. UNDP through a partnership with Peru and the United Nations Environment Programme World Conservation Monitoring Center (UNEP-WCMC), with funding from the Bezos Earth Fund, implemented the Prioritizing Nature project to support the national use of spatial data to achieve GBF Target 3 and the equivalent target at the national level.
es: En colaboración con Perú, este proyecto reúne una poderosa coalición de gobiernos, ONG, institutos de investigación y organizaciones intergubernamentales. El PNUD, mediante una asociación con Perú y el Centro Mundial de Monitoreo de la Conservación del Programa de las Naciones Unidas para el Medio Ambiente (PNUMA-ONU), con financiamiento del Bezos Earth Fund, implementó el proyecto Prioritizing Nature para apoyar el uso nacional de datos espaciales con el fin de alcanzar el Objetivo 3 del MMB y su equivalente a nivel nacional.

source: Participating institutions include: Ministry of Environment (MINAM), National Forestry and Wildlife Service (SERFOR), Supervisory Body of Forestry and Wildlife Resources (OSINFOR), National Service of Natural Protected Areas (SERNANP), National Institute for the Protection of the Environment (INAFOR), National Institute of Agricultural Research (INIA), TNC, WCS, Jica, among others.
es: Las instituciones participantes incluyen: Ministerio del Ambiente (MINAM), Servicio Nacional Forestal y de Fauna Silvestre (SERFOR), Organismo de Supervisión de los Recursos Forestales y de Fauna Silvestre (OSINFOR), Servicio Nacional de Áreas Naturales Protegidas (SERNANP), Instituto Nacional de Protección del Ambiente (INAFOR), Instituto Nacional de Innovación Agraria (INIA), TNC, WCS, JICA, entre otros.

source: Resources
es: Recursos

source: `Scoping Report <https://www.dropbox.com/scl/fi/cdje955z5no3trdtsnznw/Prioritizing-Nature-in-Peru-Scoping-Report-v080524-Final-clean.pdf?rlkey=zvfyr1jcl13h8i5u21cih741q&dl=0>`_: Report detailing the background, scope, vision, objectives, expected results and other relevant information about the Prioritizing Nature in Peru project.
es: `Informe de Alcance <https://www.dropbox.com/scl/fi/cdje955z5no3trdtsnznw/Prioritizing-Nature-in-Peru-Scoping-Report-v080524-Final-clean.pdf?rlkey=zvfyr1jcl13h8i5u21cih741q&dl=0>`_: Informe que detalla los antecedentes, alcance, visión, objetivos, resultados esperados y otra información relevante sobre el proyecto Prioritizing Nature en Perú.

source: Inception workshop:
es: Taller de inicio:

source: Recording of the inception workshop: `English <https://www.youtube.com/watch?v=JAh0s2rQBmU>`_ | `Spanish <https://www.youtube.com/watch?v=DntPA_O1-ss>`_
es: Grabación del taller de inicio: `Inglés <https://www.youtube.com/watch?v=JAh0s2rQBmU>`_ | `Español <https://www.youtube.com/watch?v=DntPA_O1-ss>`_

source: Inception workshop report: `English <https://www.learningfornature.org/wp-content/uploads/2025/04/Prioritizing-Nature-in-Peru-Inception-Workshop-Report-EN.pdf>`_ | `Spanish <https://www.learningfornature.org/wp-content/uploads/2025/04/Prioritizing-Nature-in-Peru-Inception-Workshop-Report-SP.pdf>`_
es: Informe del taller de inicio: `Inglés <https://www.learningfornature.org/wp-content/uploads/2025/04/Prioritizing-Nature-in-Peru-Inception-Workshop-Report-EN.pdf>`_ | `Español <https://www.learningfornature.org/wp-content/uploads/2025/04/Prioritizing-Nature-in-Peru-Inception-Workshop-Report-SP.pdf>`_

source: `Capacity building sessions <https://www.learningfornature.org/en/courses/prioritizing-nature-in-peru-trainings-scp-and-spatial-planning-methodology-and-applications/>`_: This series of 6 training courses provides capacity building support for the full transfer of the spatial data and planning tools produced in the Prioritizing Nature Project. It consists of a combination of self-paced courses, live training and interactive exercises that guide through the key elements of the workflow used to develop a ELSA map for Target 3 of the Kunming-Montreal Global Biodiversity Framework.
es: `Sesiones de fortalecimiento de capacidades <https://www.learningfornature.org/en/courses/prioritizing-nature-in-peru-trainings-scp-and-spatial-planning-methodology-and-applications/>`_: Esta serie de 6 cursos de formación ofrece apoyo para la transferencia completa de los datos espaciales y las herramientas de planificación producidas en el proyecto Prioritizing Nature. Consta de una combinación de cursos autodirigidos, formación en vivo y ejercicios interactivos que guían a través de los elementos clave del flujo de trabajo utilizado para desarrollar un mapa ELSA para el Objetivo 3 del Marco Mundial de Biodiversidad de Kunming-Montreal.

source: `Data included in the ELSA analysis for GBF implementation in Peru <https://www.dropbox.com/scl/fi/fzior277pw1lfjgq2jjxw/W2-Peru-Data-and-weighting-Leticia-Cardozo-SP.pdf?rlkey=bwtrxjo4r1inscmrlwtmg5tko&st=e5mqc9du&dl=0>`_: This presentation describes the datasets included in the ELSA analysis that are available in the web tool for mapping priority areas for GBF and ENDB implementation in Peru.
es: `Datos incluidos en el análisis ELSA para la implementación del MMB en Perú <https://www.dropbox.com/scl/fi/fzior277pw1lfjgq2jjxw/W2-Peru-Data-and-weighting-Leticia-Cardozo-SP.pdf?rlkey=bwtrxjo4r1inscmrlwtmg5tko&st=e5mqc9du&dl=0>`_: Esta presentación describe los conjuntos de datos incluidos en el análisis ELSA que están disponibles en la herramienta web para mapear áreas prioritarias para la implementación del MMB y DEBB en Perú.
