Repository: UNDP-UNBL/elsa-documentation
Catalog: archive/sphinx-locales/*/LC_MESSAGES/guidance/peru/0211_download.po
Languages: es

source: 2.11 Viewing and downloading maps
es: 2.11 Visualización y descarga de mapas

source: After running the optimization, you will be able to view and download 8 result maps in raster format, of which 4 correspond to heatmaps and 4 correspond to ELSA maps for your country based on the results of the analysis to identify priority areas for the implementation of the ENDB in Peru.
es: Tras ejecutar la optimización, podrá visualizar y descargar 8 mapas de resultado en formato ráster: 4 corresponden a mapas de calor y 4 a mapas ELSA para su país, basados en los resultados del análisis para identificar áreas prioritarias para la implementación de la DEBB en Perú.

source: Table 3
es: Tabla 3

source: Table 3. Spatial prioritization maps identifying priority areas for ENDB implementation available for download on the Prioritizing Nature webtool.
es: Tabla 3. Mapas de priorización espacial que identifican áreas prioritarias para la implementación de la DEBB disponibles para descargar en la herramienta web Prioritizing Nature.

source: **Steps**
es: **Pasos**

source: Click on the fourth tab *"Results Map"* to view the ELSA ELSA maps in the webtool.
es: Haga clic en la cuarta pestaña *«Mapa de resultados»* para ver los mapas ELSA en la herramienta web.

source: Zoom in on certain areas by clicking on the "+" icon.
es: Acerque el zoom en ciertas áreas haciendo clic en el icono "+".

source: You can switch to different basemap views by clicking on the layers icon located on the left, three basemap options will be displayed including the satellite view, click on the basemap of your interest to enable the layer (Figure 12).
es: Puede cambiar entre diferentes vistas de mapa base haciendo clic en el icono de capas ubicado a la izquierda. Se mostrarán tres opciones de mapa base, incluida la vista satelital; haga clic en el mapa base de su interés para activar la capa (Figura 12).

source: Figure 12. Base map options
es: Figura 12. Opciones de mapa base

source: To download the maps in raster or GeoTIFFs format, which can be viewed and analyzed in GIS software. Click on the "Results + Download" tab and then on "Download results (GIS layers)" to download the result maps (Figure 13).
es: Para descargar los mapas en formato ráster o GeoTIFF, que pueden verse y analizarse en software SIG, haga clic en la pestaña «Resultados + Descarga» y luego en «Descargar resultados (capas SIG)» para obtener los mapas de resultado (Figura 13).

source: Figure 13. Downloading result maps
es: Figura 13. Descarga de mapas de resultado

source: When using the ELSA map in a formal report or publication, please use the following citation:
es: Al usar el mapa ELSA en un informe formal o publicación, utilice la siguiente cita:

source: **MINAM and UNDP 2025. Prioritizing Nature Project. Map created using spatial data and the Prioritizing Nature webtool in Peru https://elsa.unbiodiversitylab.org/Bezos_PER/, on [insert date with Day Month Year].**
es: **MINAM y PNUD 2025. Proyecto Prioritizing Nature. Mapa creado utilizando datos espaciales y la herramienta web Prioritizing Nature en Perú https://elsa.unbiodiversitylab.org/Bezos_PER/, el [inserte fecha con Día Mes Año].**
